{
  "book": "Mavericks (Expeditionary Force Book 6) - Craig Alanson.epub",
  "stats": {
    "total_chapters": 36,
    "total_paragraphs": 4051,
    "skippy_entries": 37,
    "tone_distribution": {
      "neutral": 29,
      "insult": 6,
      "technobabble": 3,
      "emotional": 1
    },
    "partner_distribution": {
      "unknown": 17,
      "joe": 15,
      "crew": 5
    }
  },
  "entries": [
    {
      "skippy_text": "“Elevator version?” Skippy asked, puzzled, then\nhe got excited. “Ooooh, you mean like elevator music? I suppose I could put the\nstory into a musical format, like an epic opera. In fact, that is a \ngreat\n idea-”",
      "full_paragraph": "“Elevator version?” Skippy asked, puzzled, then\nhe got excited. “Ooooh, you mean like elevator music? I suppose I could put the\nstory into a musical format, like an epic opera. In fact, that is a \ngreat\n idea-”",
      "trigger": "“Aye aye, Captain,” Desai replied and pressed a\nbutton. The only change on the main bridge display was the faint dot of the\nlocal star had disappeared, because we were now in interstellar space. If you\nwere ever looking for nowhere, we were smack in the middle of it.",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“We have plenty of time for that later, Joe. I\ndownloaded all the info to your tablets and laptops, you can read the whole\nstory in detail any time you like. Right now, we need to prepare for the\nrefueling operation. I suggest-”\n“Uh huh, sure,” I cut off the beer can before he\ncould get into geeky technical details of the risky op to extract fuel. “How\nabout you give us the elevator version of the story?”",
      "context_after": "“No, that is a \nterrible\n idea!” I waved my hands while seeing panicked faces in the\nCIC. No one wanted to give Skippy an excuse to sing. “I meant, like an elevator\npitch, you know?” I had read that concept in one of the US Army PowerPoint\nslides I was supposed to study for officer training. “Give us the thirty second\nversion of the story.”",
      "paragraph_index": 13,
      "chapter_index": 1,
      "chapter_id": "text/part0000_split_003.html"
    },
    {
      "skippy_text": "“Yup,” Skippy replied with bubbly good cheer.\n“And you’ll like this one, because it is easy-peasy.”",
      "full_paragraph": "“Yup,” Skippy replied with bubbly good cheer.\n“And you’ll like this one, because it is easy-peasy.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“The good news is, if I can purge the system of\nthe energy virus, the powercells should recharge without any lasting effects. I\nthink. I’ve never encountered an energy virus so all I have to go on is theory.\nTruthfully, I’m kind of making shit up as I go.”\n“OK,” I ran a hand through my hair and\ntook a deep breath while I processed the latest disaster that had struck the\nMerry Band of Pirates. “You got any ideas how to purge this energy virus from\nthe ship?”",
      "context_after": "“Would you care to enlighten me, Oh Great One?”",
      "paragraph_index": 86,
      "chapter_index": 1,
      "chapter_id": "text/part0000_split_003.html"
    },
    {
      "skippy_text": "“Hey, Joe!” Skippy shouted as he played\n‘Reveille’ in my helmet speakers. “Rise and shine, sleepyhead. Time to go to\nwork.”",
      "full_paragraph": "“Hey, Joe!” Skippy shouted as he played\n‘Reveille’ in my helmet speakers. “Rise and shine, sleepyhead. Time to go to\nwork.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "there was not a third Bandit movie, because it was so instantly forgettable.”\nCrap. He was right, there was a Part Three.\nMercifully, I fell asleep after about an hour and Skippy didn’t wake me for\nanother six hours.",
      "context_after": "“Oh, man. Good morning. How about coffee first?”",
      "paragraph_index": 45,
      "chapter_index": 24,
      "chapter_id": "text/part0000_split_026.html"
    },
    {
      "skippy_text": "“Hmm,” Skippy announced unhappily. “The membrane\nis taking more power than expected to warm up. Joe, you and Desai need to\ndisconnect and stop the power flow from your suits.”",
      "full_paragraph": "“Hmm,” Skippy announced unhappily. “The membrane\nis taking more power than expected to warm up. Joe, you and Desai need to\ndisconnect and stop the power flow from your suits.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "Skippy had grumbled that fuel cells were an\nancient and crude technology, so old they had been used aboard the Apollo\nspacecraft that first took humans to the Moon. With all his grumbling, he\nagreed it was a decent idea and more importantly, fuel cells were relatively\nsimple and the \nDutchman\n had the\nmanufacturing capacity to make the membranes.\nDesai and I carefully turned stiff valves and\npumped levers to get the pressurized liquid oxygen and hydrogen flowing. Then,\nin the scariest part of the operation, we had to connect our already depleted\nsuit powercells to the membrane to bring it up to operating temperature. I\nwatched with alarm as the power level of my suit drained quickly, even though I\nhad the heaters turned off.",
      "context_after": "“Desai,” I ordered, “do it.”",
      "paragraph_index": 113,
      "chapter_index": 24,
      "chapter_id": "text/part0000_split_026.html"
    },
    {
      "skippy_text": "“I hate to admit this, but you do have a point,”\nSkippy sighed.",
      "full_paragraph": "“I hate to admit this, but you do have a point,”\nSkippy sighed.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“There are three other dropships with fuel\ncells, Joe,” Skippy reminded me.\n“Yes, but we reached this one first,” I\nprotested. Desai and I had been given the closest and easiest target, so we\nwere already aboard our Condor while the other three retrieval teams were still\napproaching their dropships. “If we can’t figure out how to make this fuel cell\nwork, that’s not good news for the other teams. Once this thing starts\nproducing electricity, I can reverse the power flow and recharge my suit. If we\ncan’t get it working, I’m screwed anyway.”",
      "context_after": "“Colonel Bishop,” Desai waved a hand to get my\nattention, “I should drain my suit also, to give us the best chance to-”",
      "paragraph_index": 119,
      "chapter_index": 24,
      "chapter_id": "text/part0000_split_026.html"
    },
    {
      "skippy_text": "“Joe, you idiot! That handle can’t provide\nenough power to get your suit restarted!” Skippy warned. “Disconnect now!”",
      "full_paragraph": "“Joe, you idiot! That handle can’t provide\nenough power to get your suit restarted!” Skippy warned. “Disconnect now!”",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "joe",
      "context_before": "“Colonel Bishop,” Desai waved a hand to get my\nattention, “I should drain my suit also, to give us the best chance to-”\n“Negative, Desai. As long as you still have\npower, you can talk with Skippy to troubleshoot this damned thing. Look, I’m\nturning my oxygen mask on,” I told her as my power meter dropped to one\npercent. “And I’ll crank the handle again,” I hooked my feet under the fuel\ncell so my motion didn’t send me flying around the cargo bay.",
      "context_after": "“But-”",
      "paragraph_index": 122,
      "chapter_index": 24,
      "chapter_id": "text/part0000_split_026.html"
    },
    {
      "skippy_text": "Desai and I waited, both of us cranking handles\nto build up power in our dangerously-depleted suit power cells. It took eight\nlong minutes before Skippy announced we both could use the fuel cell to provide\npower to our suits. “Is that smart, Skippy? Shouldn’t we get the auxiliary\npower unit going first?”",
      "full_paragraph": "Desai and I waited, both of us cranking handles\nto build up power in our dangerously-depleted suit power cells. It took eight\nlong minutes before Skippy announced we both could use the fuel cell to provide\npower to our suits. “Is that smart, Skippy? Shouldn’t we get the auxiliary\npower unit going first?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Aye aye,” I shuddered, thinking how close I had\ncome to disaster. With the handle fitted to the gear again, I pulled and\npushed. The power meter stayed stubbornly at one percent, but it didn’t drop,\nso I counted that as a win. “What about the fuel cell?”\n“Give it time. It is warming up slowly, the heat\nneeds time to propagate. Don’t be so impatient, Joe,” he chided me. “And, mmm,\nyes! Success. The reaction is starting. I’m feeding all the power generated\ninto the heater unit, to bring it up to optimal temperature.”",
      "context_after": "“I said it, so of course it is smart, \nduh\n. The APU can’t be restarted until\nthe dropship’s powercells have enough charge to energize the containment field.\nWhile we’re waiting for that, you two should take the opportunity to top up\nyour own powercells. You may need to assist the other teams, and you’ll need a\nhealthy charge to do that.”",
      "paragraph_index": 129,
      "chapter_index": 24,
      "chapter_id": "text/part0000_split_026.html"
    },
    {
      "skippy_text": "Three hours later, Skippy blew the explosive\nbolts and ejected the contaminated powercells away from our starship, prompting\ncheers aboard all four dropships. We still could not go back to the ship,\nbecause there was no point going aboard until Skippy had power restored. That\ntook a bit longer than the beer can estimated, still we were able to cut more\nthan a full day off Skippy’s original schedule of eighty six hours. There were\nsmiles all around when we detected heat from the backup reactor, and Skippy\nannounced that ‘Spacebnb’ was now accepting reservations for cabins aboard the\nship. “It will take another hour before hot water is available for showers,” he\nwarned. “I had to drain all the pipes before the water in them froze while the\nship was shut down, and I’m having to let water trickle back in slowly.”",
      "full_paragraph": "Three hours later, Skippy blew the explosive\nbolts and ejected the contaminated powercells away from our starship, prompting\ncheers aboard all four dropships. We still could not go back to the ship,\nbecause there was no point going aboard until Skippy had power restored. That\ntook a bit longer than the beer can estimated, still we were able to cut more\nthan a full day off Skippy’s original schedule of eighty six hours. There were\nsmiles all around when we detected heat from the backup reactor, and Skippy\nannounced that ‘Spacebnb’ was now accepting reservations for cabins aboard the\nship. “It will take another hour before hot water is available for showers,” he\nwarned. “I had to drain all the pipes before the water in them froze while the\nship was shut down, and I’m having to let water trickle back in slowly.”",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "joe",
      "context_before": "“Deal. Oh, Joe, I can’t wait to show you my\nsurprise; two lost episodes of ‘Casablanca’.”\n“Oh, man,” I groaned. “Can’t they stay lost?”",
      "context_after": "“No problem, Skippy, it will take us more than an\nhour to get back and secure the dropships anyway. What about gravity?”",
      "paragraph_index": 200,
      "chapter_index": 24,
      "chapter_id": "text/part0000_split_026.html"
    },
    {
      "skippy_text": "“There is still a \nlot\n of work to do, Joe,” Skippy protested, then he shouted “Hey!”\nwhen Adams set down the tray, cutting right through the hologram of his avatar.\n“Hmmmph. If \nthat’s\n the respect I get\naround here-”",
      "full_paragraph": "“There is still a \nlot\n of work to do, Joe,” Skippy protested, then he shouted “Hey!”\nwhen Adams set down the tray, cutting right through the hologram of his avatar.\n“Hmmmph. If \nthat’s\n the respect I get\naround here-”",
      "trigger": "“What makes you think we’ve been working on a\nproblem?” I asked with a guilty look toward Admiral Skippy.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“What makes you think we’ve been working on a\nproblem?” I asked with a guilty look toward Admiral Skippy.\nShe didn’t reply, she didn’t need to. She cocked\nher head at me and gave me a look. You know, a \nlook\n. I folded like a cheap suit. She knew me too well. “Yeah,” I\nadmitted, “we think we’ve narrowed the search area to a manageable size, and\nwe’re fairly sure the Keepers haven’t landed yet.”",
      "context_after": "“We all know \nyou",
      "paragraph_index": 197,
      "chapter_index": 25,
      "chapter_id": "text/part0000_split_027.html"
    },
    {
      "skippy_text": "“Holy shit.” That revelation completely floored\nme. Because Skippy said Elder-level technology had been used to throw Newark\nfarther from the star, and the dead AI was presumably an Elder device, there\nhad been speculation among the crew that the AI the scavenger team of Kristang\nfound on Newark had been involved in committing genocide. At the time, Skippy\nhad been adamant that no Elder AI could have harmed an innocent species. Now he\nwas admitting he had been completely wrong? “Are you-Ah, of course you’re sure\nabout it. Damn, Skippy, I am sorry.” The little beer can had to be feeling\ncompletely miserable. As far as he knew, he was the only remaining one of his\nkind, he was alone, and now he learned a fellow Elder AI did something utterly\nunthinkable.",
      "full_paragraph": "“Holy shit.” That revelation completely floored\nme. Because Skippy said Elder-level technology had been used to throw Newark\nfarther from the star, and the dead AI was presumably an Elder device, there\nhad been speculation among the crew that the AI the scavenger team of Kristang\nfound on Newark had been involved in committing genocide. At the time, Skippy\nhad been adamant that no Elder AI could have harmed an innocent species. Now he\nwas admitting he had been completely wrong? “Are you-Ah, of course you’re sure\nabout it. Damn, Skippy, I am sorry.” The little beer can had to be feeling\ncompletely miserable. As far as he knew, he was the only remaining one of his\nkind, he was alone, and now he learned a fellow Elder AI did something utterly\nunthinkable.",
      "trigger": "",
      "tones": [
        "technobabble",
        "emotional"
      ],
      "partner": "joe",
      "context_before": "“Great! So, was it like you?”\n“Its basic matrix was very much like me, which\nis troubling because of what else I learned.” The avatar froze and flickered\nfor a second, nearly making my heart stop but before I could say anything, the\navatar moved again. “I would like to double-check my analysis, but I am\nconfident there can be no mistake about it. Joe, that AI was involved in\nthrowing the planet Newark out of its original orbit. That Elder AI wiped out\nan intelligent species.”",
      "context_after": "“Not as sorry as I am, Joe. The reason I asked\nyou to meet me here is I need you to do something for me.”",
      "paragraph_index": 66,
      "chapter_index": 26,
      "chapter_id": "text/part0000_split_028.html"
    },
    {
      "skippy_text": "CHAPTER TWENTY SEVEN\nI didn’t have much to do while we slowly took on\nfuel, so I had too much time to be stuck inside my stupid head. Yeah, I was\ntrying to think of a better way to find a single stealthed Kristang ship in the\nvast distances of a star system, but my mind kept getting dragged back to other\nthings. Like, mostly, Shauna. Specifically, Shauna and Cornpone. I should call\nhim Jesse, I guess, old habits are hard to break. It had been years since I\nlast spoke with Jesse, or Dave or Shauna. The last time we were at Paradise, to\nplant the fake Elder artifacts that persuaded the Ruhar to keep that planet, I\nhad asked Skippy to give me a view of people I had known there. No, I was not\ndoing anything creepy, I just wanted to see and hear them when they were using\nthe video feature of their zPhones. It had been heartbreaking to see people I\nconsidered my friends, even Perkins, and hear their fears of being trapped on\nParadise forever. Their fears that the population of Earth might be enslaved or\nextinct.",
      "full_paragraph": "CHAPTER TWENTY SEVEN\nI didn’t have much to do while we slowly took on\nfuel, so I had too much time to be stuck inside my stupid head. Yeah, I was\ntrying to think of a better way to find a single stealthed Kristang ship in the\nvast distances of a star system, but my mind kept getting dragged back to other\nthings. Like, mostly, Shauna. Specifically, Shauna and Cornpone. I should call\nhim Jesse, I guess, old habits are hard to break. It had been years since I\nlast spoke with Jesse, or Dave or Shauna. The last time we were at Paradise, to\nplant the fake Elder artifacts that persuaded the Ruhar to keep that planet, I\nhad asked Skippy to give me a view of people I had known there. No, I was not\ndoing anything creepy, I just wanted to see and hear them when they were using\nthe video feature of their zPhones. It had been heartbreaking to see people I\nconsidered my friends, even Perkins, and hear their fears of being trapped on\nParadise forever. Their fears that the population of Earth might be enslaved or\nextinct.",
      "trigger": "",
      "tones": [
        "insult",
        "technobabble"
      ],
      "partner": "unknown",
      "context_before": "",
      "context_after": "So, that was my distracted and depressed mindset\nwhen I came around a corner of the passageway, and I saw Count freakin’ Chocula\nstanding in the open doorway of a cabin. It wasn’t his cabin, his was forward,\non the opposite side of the bridge/CIC complex from my own cabin. This cabin\nwas aft near the cargo bays our science team used as workspaces.",
      "paragraph_index": 0,
      "chapter_index": 27,
      "chapter_id": "text/part0000_split_029.html"
    },
    {
      "skippy_text": "“Hey, Joe,” Skippy interrupted. “You are, uh,\ngoing to your cabin right now?”",
      "full_paragraph": "“Hey, Joe,” Skippy interrupted. “You are, uh,\ngoing to your cabin right now?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“I will when you take off those shiny silver\neagles,” she looked me in the eyes, “Sir.”\nI sighed, knowing she was right. The passageway\nsplit, the medical bay to the left and my cabin straight ahead. “Let me stop by\nmy cabin to get a fresh shirt, if Mad Doctor Skippy is going to look at my\nshoulder.”",
      "context_after": "“Yup.” I paused at the door to my cabin. “Then you\nneed to look at my shoulder.”",
      "paragraph_index": 61,
      "chapter_index": 27,
      "chapter_id": "text/part0000_split_029.html"
    },
    {
      "skippy_text": "“Oh, shit.” I knew what it meant when that beer\ncan said ‘heh heh’. “What the hell did you do?”",
      "full_paragraph": "“Oh, shit.” I knew what it meant when that beer\ncan said ‘heh heh’. “What the hell did you do?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“Yup.” I paused at the door to my cabin. “Then you\nneed to look at my shoulder.”\n“Sure thing, heh heh, no problem. Why don’t you go\nstraight to medical? No need to change your shirt. Nosireee, \nno\n need for you to go in that cabin\nright now.”",
      "context_after": "“Oh, nothing. Ok, not \nnothing\n, nothing important. Damn it, this was supposed to be a\nsurprise. Hey, Sergeant Adams, heh heh, shouldn’t you go to your own cabin\nfirst?”",
      "paragraph_index": 64,
      "chapter_index": 27,
      "chapter_id": "text/part0000_split_029.html"
    },
    {
      "skippy_text": "The bot stopped moving suggestively, but then it\nstood up and walked into the open doorway, its hips and other things swaying\nwith every step. “She can do all the other things women do in bed,” Skippy\nexplained. “You know, like pretending to be interested while you talk blah,\nblah, blah endlessly about yourself. Or like faking that you were a good lover.\nAlthough with you, sheesh, \nthat’s",
      "full_paragraph": "The bot stopped moving suggestively, but then it\nstood up and walked into the open doorway, its hips and other things swaying\nwith every step. “She can do all the other things women do in bed,” Skippy\nexplained. “You know, like pretending to be interested while you talk blah,\nblah, blah endlessly about yourself. Or like faking that you were a good lover.\nAlthough with you, sheesh, \nthat’s",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“That’s not all she does, Joe, she is \nfully\n functional, if you know what I\nmean.”\n“Fully-Oh God. What else does she, it,” my brain\nlocked up as the sexbot moved its hips in a circle and I couldn’t look away.\n“Can you make it stop doing that?”",
      "context_after": "going to take an Oscar-worthy performance. You’ll need to grade her on a curve\nuntil she learns. Speaking of learning, I programmed her with a wide variety of\nreally \nweird\n stuff based on your browser\nhistory, so-”",
      "paragraph_index": 81,
      "chapter_index": 27,
      "chapter_id": "text/part0000_split_029.html"
    },
    {
      "skippy_text": "“\nRelationship\n?”\nSkippy scoffed. “Joe, right now your only \nre-LAY-tionship\n,”\nhe made a gagging sound, “is with the shower in your cabin.”",
      "full_paragraph": "“\nRelationship\n?”\nSkippy scoffed. “Joe, right now your only \nre-LAY-tionship\n,”\nhe made a gagging sound, “is with the shower in your cabin.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "to do it in the gym, I guess I could-”\n“Skippy, you are a beer can so you don’t\nunderstand these things. I want a real woman, I want to have a relationship-”",
      "context_after": "“I don’t-”",
      "paragraph_index": 97,
      "chapter_index": 27,
      "chapter_id": "text/part0000_split_029.html"
    },
    {
      "skippy_text": "“Damn,” Skippy said under his breath. “Jeez, in\nsome cultures you and that shower would be considered \nmarried\n by now.”",
      "full_paragraph": "“Damn,” Skippy said under his breath. “Jeez, in\nsome cultures you and that shower would be considered \nmarried\n by now.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“\nRelationship\n?”\nSkippy scoffed. “Joe, right now your only \nre-LAY-tionship\n,”\nhe made a gagging sound, “is with the shower in your cabin.”\n“I don’t-”",
      "context_after": "“Skip-”",
      "paragraph_index": 99,
      "chapter_index": 27,
      "chapter_id": "text/part0000_split_029.html"
    },
    {
      "skippy_text": "“\nSKIPPY\n!”\nI looked to Adams for help but she was leaning against the bulkhead, one hand\nover her eyes, tears of laughter rolling down her cheeks, her shoulders\nshaking. And, damn it, she wasn’t the only person who saw the naked sexbot\nstretched languidly in the door frame, and heard what Skippy said. They must\nhave heard the commotion and came around the corner from the CIC. Half of them\nwere laughing, hands over their faces, unable to look at me. The other half\nwere staring in shock at the sexbot as it wiggled its hips slowly. “All right,\npeople, move along,” I ordered through gritted teeth. “Nothing to see here.\nSkippy was playing a joke on me.”",
      "full_paragraph": "“\nSKIPPY\n!”\nI looked to Adams for help but she was leaning against the bulkhead, one hand\nover her eyes, tears of laughter rolling down her cheeks, her shoulders\nshaking. And, damn it, she wasn’t the only person who saw the naked sexbot\nstretched languidly in the door frame, and heard what Skippy said. They must\nhave heard the commotion and came around the corner from the CIC. Half of them\nwere laughing, hands over their faces, unable to look at me. The other half\nwere staring in shock at the sexbot as it wiggled its hips slowly. “All right,\npeople, move along,” I ordered through gritted teeth. “Nothing to see here.\nSkippy was playing a joke on me.”",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "unknown",
      "context_before": "“I\ndon’t-”\n“And you are getting \nsuper\n cranky, you need to get laid soon or I’m afraid you will\nexplode. How about-”",
      "context_after": "“Oh, it’s no joke, Joe,” Skippy’s voice was again\nperky. “Anastacia is fully functional, certainly more than you could-”",
      "paragraph_index": 106,
      "chapter_index": 27,
      "chapter_id": "text/part0000_split_029.html"
    },
    {
      "skippy_text": "“It’s fine, Joe,” Skippy answered peevishly.\n“Jeez Louise, that info is right on the main display.”",
      "full_paragraph": "“It’s fine, Joe,” Skippy answered peevishly.\n“Jeez Louise, that info is right on the main display.”",
      "trigger": "“Stealth field status?” I asked to anyone who\nhad that data.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "I saw her share a private thumbs up with Porter,\nas they turned the ship to skim the rim of the gas giant planet. Skim, not\ntouch. To gain speed and get the ship turned on course toward Gingerbread, we\nhad to slingshot around Notol, using its gravity well to gain free velocity.\n“Stealth field status?” I asked to anyone who\nhad that data.",
      "context_after": "“No, Your Supreme Assholeness, the main display\nshows the status of the stealth field generators, and the density and shape of\nthe field surrounding the ship. It does not, as \nyou\n reminded me more than once, indicate how effective our stealth\ncapability is. The ship could be trailing a stream of ionized particles from\nour passage through the atmosphere, which would point straight toward the ship\nlike a giant neon arrow.”",
      "paragraph_index": 26,
      "chapter_index": 29,
      "chapter_id": "text/part0000_split_031.html"
    },
    {
      "skippy_text": "Our plan relied on a lot of missiles, but that\nwas Ok because we had plenty aboard. We had so many missiles there wasn’t\nenough space in the ship’s magazines to store them, so we moved stuff around to\nempty out cargo bays and stuff missiles in there. Yes, if the ship took a hit\nto one of those poorly-protected cargo bays, the ship would go ‘Boom’ in a big\nway, but we’d be screwed if we took a direct hit anywhere so as Skippy said\ncheerily, there really was no downside.",
      "full_paragraph": "Our plan relied on a lot of missiles, but that\nwas Ok because we had plenty aboard. We had so many missiles there wasn’t\nenough space in the ship’s magazines to store them, so we moved stuff around to\nempty out cargo bays and stuff missiles in there. Yes, if the ship took a hit\nto one of those poorly-protected cargo bays, the ship would go ‘Boom’ in a big\nway, but we’d be screwed if we took a direct hit anywhere so as Skippy said\ncheerily, there really was no downside.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“All tubes loaded and ready,” Major Simms\nreported from the CIC.\n“Launch and reload. Then keep going. We need a\nlot of birds in flight for this op.”",
      "context_after": "Our surplus of missiles came from the junkyard\nof shattered ships floating around the Roach Motel. Yes, all these missiles\nwere obsolete and they didn’t all come with fancy options like functional\nwarheads, sensors and guidance systems, but we didn’t always need those. Skippy\nhad been able to cobble together a Frankenstein assortment of parts to create\nsensors and guidance systems, and for our initial mission in the Paradise\nsystem, we did not need warheads. The first volleys of missiles did not need\nwarheads, they only needed speed and stealth, for where their explosive charges\nused to be, they each carried one end of a microwormhole.",
      "paragraph_index": 34,
      "chapter_index": 29,
      "chapter_id": "text/part0000_split_031.html"
    },
    {
      "skippy_text": "When Skippy said ‘close’ and then ‘for a\nminute’, I expected he would nail the location of the enemy ship quickly, like\nwithin ten minutes. Instead, it took forty seven minutes, during which time I\nsat quietly but growing more stressed with every second that passed. Finally,\nwhen I was about to go crazy from waiting and doing nothing, the beer can\nspoke. “Got it! That ship is an old \nMorta\n-class\ndestroyer, when I say old I mean the last \nMorta\n-class\nleft the shipyard over five hundred years ago. Damn, no wonder it is leaving a\ntrail of radioactive particles behind like breadcrumbs. Wait, wait, give me\nanother moment and I will have that ship positively identified. Bingo! It is\nthe ‘\nFinal Crushing Blow to the Enemy’s\nSpirit’\n. We can probably call it the ‘\nSpirit\n’\nfor short.”",
      "full_paragraph": "When Skippy said ‘close’ and then ‘for a\nminute’, I expected he would nail the location of the enemy ship quickly, like\nwithin ten minutes. Instead, it took forty seven minutes, during which time I\nsat quietly but growing more stressed with every second that passed. Finally,\nwhen I was about to go crazy from waiting and doing nothing, the beer can\nspoke. “Got it! That ship is an old \nMorta\n-class\ndestroyer, when I say old I mean the last \nMorta\n-class\nleft the shipyard over five hundred years ago. Damn, no wonder it is leaving a\ntrail of radioactive particles behind like breadcrumbs. Wait, wait, give me\nanother moment and I will have that ship positively identified. Bingo! It is\nthe ‘\nFinal Crushing Blow to the Enemy’s\nSpirit’\n. We can probably call it the ‘\nSpirit\n’\nfor short.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "Since my understanding of fusion power was sadly\nlacking, I dropped the subject. “If it is so superduper difficult, how do you\nplan to find any dropships in there?”\n“Working on it, Joe, working on it. You could\nhelp tremendously by shutting your pie hole for a moment and let the adults\nhandle this. The first pair of missiles is now picking up trace amounts of samarium\ncobalt that has been embrittled by heavy neutron bombardment, which makes me\ncertain of two things. First, samarium cobalt is used in secondary magnetic\nplasma containment systems aboard older Kristang ships, so the particle trail\nis absolutely from a small lizard warship such as a frigate or destroyer. Any\nlarger capital ship would have had its containment system overhauled and\nupgraded by now. Second, the missiles are getting close enough to the target\nship that I can now release one of the microwormholes for scanning. I’m going\nto be busy, so kindly shut up for a minute.”",
      "context_after": "“Great.”",
      "paragraph_index": 68,
      "chapter_index": 29,
      "chapter_id": "text/part0000_split_031.html"
    },
    {
      "skippy_text": "“Whoa! Whoa there, Joe. What are you doing?”\nSkippy interrupted.",
      "full_paragraph": "“Whoa! Whoa there, Joe. What are you doing?”\nSkippy interrupted.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Hmm? Oh, yeah, sorry, kind of got wrapped up in\nthe moment. A pair of stealthed dropships, Joe, tucked inside the cluster of\ncomet debris that will rain down on southern Lemuria as a meteor shower in\nthree days. What I do not see are aeroshells, which tells me the Keepers have\nnot yet deployed. They must still be inside the dropships.”\n“Outstanding,” I clapped my hands together\nhappily. “That makes for an easier targeting solution. Colonel Chang, lock two\nmissiles on-”",
      "context_after": "“I’m going to blow those idiot Keepers to hell,\nSkippy, and end the threat to Paradise. Why the hell else do you think we were\nlooking for them? Oh, shit,” I slapped my forehead. “Unless hitting them with a\nmissile right now will cause their infected body parts to rain down all over\nParadise?” Damn it, I am a moron. That is a question I should have asked Skippy\nway before we located those dropships.",
      "paragraph_index": 99,
      "chapter_index": 29,
      "chapter_id": "text/part0000_split_031.html"
    },
    {
      "skippy_text": "“I’m going to blow those idiot Keepers to hell,\nSkippy, and end the threat to Paradise. Why the hell else do you think we were\nlooking for them? Oh, shit,” I slapped my forehead. “Unless hitting them with a\nmissile right now will cause their infected body parts to rain down all over\nParadise?” Damn it, I am a moron. That is a question I should have asked Skippy\nway before we located those dropships.",
      "full_paragraph": "“I’m going to blow those idiot Keepers to hell,\nSkippy, and end the threat to Paradise. Why the hell else do you think we were\nlooking for them? Oh, shit,” I slapped my forehead. “Unless hitting them with a\nmissile right now will cause their infected body parts to rain down all over\nParadise?” Damn it, I am a moron. That is a question I should have asked Skippy\nway before we located those dropships.",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "joe",
      "context_before": "“Outstanding,” I clapped my hands together\nhappily. “That makes for an easier targeting solution. Colonel Chang, lock two\nmissiles on-”\n“Whoa! Whoa there, Joe. What are you doing?”\nSkippy interrupted.",
      "context_after": "“No, Joe, our missile warheads are sufficiently\npowerful to turn the contents of those dropships into subatomic particles,\nalthough we will need to coordinate their detonation to within a nanosecond of\neach other. The reason I stopped you is we should not just do the simple dumb\nguy thing and blow shit up.”",
      "paragraph_index": 100,
      "chapter_index": 29,
      "chapter_id": "text/part0000_split_031.html"
    },
    {
      "skippy_text": "Skippy answered for me. “Because, Major Smythe’s\nplan will not include little Joey tagging along as a mascot. You should stay\nhere, right here, where you can’t do any harm. Not much harm, anyway, because I\nwill be here to keep you out of trouble.”",
      "full_paragraph": "Skippy answered for me. “Because, Major Smythe’s\nplan will not include little Joey tagging along as a mascot. You should stay\nhere, right here, where you can’t do any harm. Not much harm, anyway, because I\nwill be here to keep you out of trouble.”",
      "trigger": "“Why do I have the feeling I will very much not\nlike whatever plan he thinks up?” I asked to no one in particular.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Yes, Sir,” he replied eagerly, spun crisply on\nhis heels and strode off down the passageway.\n“Why do I have the feeling I will very much not\nlike whatever plan he thinks up?” I asked to no one in particular.",
      "context_after": "While\nSmythe’s team dreamed up crazy plans, Skippy gathered all the data he could get\nabout those dropships. “Ok, I’m done analyzing both of them. Can’t get any more\ndata from out here, without alerting the Kristang that someone is watching\nthem.”",
      "paragraph_index": 126,
      "chapter_index": 29,
      "chapter_id": "text/part0000_split_031.html"
    },
    {
      "skippy_text": "“Joe, this much talent can’t be contained\nforever,” Skippy warned.",
      "full_paragraph": "“Joe, this much talent can’t be contained\nforever,” Skippy warned.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“How about Klingon opera?”\n“Not that either,” I hastened to say, not\nknowing whether he was joking or not.",
      "context_after": "“Oh bullocks,” Smythe sighed. “Mister Skippy,\ncould you save your remarkable singing talent for the next time we have a\nprisoner to interrogate, like that Maxolhx? Sir,” he turned to me, “special\noperations troops are trained to resist interrogation. I know one of the\nAmerican outfits uses a recording of the poem ‘Boots’ by Rudyard Kipling,\nbecause it is bloody awful and monotonous and goes on forever; it is impossible\nto ignore. The SAS uses similar tactics, but nothing compares to your beer can\nsinging opera.”",
      "paragraph_index": 42,
      "chapter_index": 30,
      "chapter_id": "text/part0000_split_032.html"
    },
    {
      "skippy_text": "“Oh really?” The beer can asked with icy\nsarcasm. “How come you never participate on karaoke night?”",
      "full_paragraph": "“Oh really?” The beer can asked with icy\nsarcasm. “How come you never participate on karaoke night?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Hey!” Skippy was insulted. “Have you ever heard\nJoe sing? His voice is \nterrible\n.”\n“My voice is not that bad.”",
      "context_after": "“Because I, uh, because-”",
      "paragraph_index": 47,
      "chapter_index": 30,
      "chapter_id": "text/part0000_split_032.html"
    },
    {
      "skippy_text": "“You say that \nevery\n time you look at her file,” Skippy\nsighed. “Joe, you never asked Sergeant Adams why she was in that jail on\nParadise.”",
      "full_paragraph": "“You say that \nevery\n time you look at her file,” Skippy\nsighed. “Joe, you never asked Sergeant Adams why she was in that jail on\nParadise.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Hey, Joe, you\ndidn’t finish.”\n“Not today, Skippy.”",
      "context_after": "“She refused orders\nfrom the lizards just like me, I don’t need details.”",
      "paragraph_index": 61,
      "chapter_index": 30,
      "chapter_id": "text/part0000_split_032.html"
    },
    {
      "skippy_text": "“Are you Ok, Joe?” Skippy asked quietly, in that\nrarely-used tone indicating he was being completely serious.",
      "full_paragraph": "“Are you Ok, Joe?” Skippy asked quietly, in that\nrarely-used tone indicating he was being completely serious.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "Crap. No, that’s not what I want either. Ok,\nyes, I do want that. Problem is, I am Margaret Adams’ commanding officer, and\nby the rules of the US military, that is the end of the discussion, period.\nSometimes I really, really hate my job.",
      "context_after": "“Yeah, I’m fine,” I gulped more cold coffee,\nwhich sucked. “My throat is dry, been talking too much. And this damned coffee\nis cold.”",
      "paragraph_index": 67,
      "chapter_index": 30,
      "chapter_id": "text/part0000_split_032.html"
    },
    {
      "skippy_text": "To help the assault teams, Skippy had performed\nwhat he considered a rather lame bit of magic. Using microwormholes he had very\ngently moved into position behind each dropship, he projected stealth fields\nthrough the event horizon and wrapped them around the sensor trailing behind\nthe dropships. With the sensors now unable to receive real photons from outside\nthe stealth field, Skippy fed false data to the sensors, data which showed only\nhappy views of utterly benign, empty space other than the rocks and ice the\nKristang expected. The beer can had wanted to try transmitting a virus down the\nsensor cable, to partially take control of the dropships that way, but Little\nJoey Bishop the Buzzkill Party Pooper had vetoed that no doubt cool but risky\nand unnecessary stunt. So, Skippy was bored while he waited for the assault\nteam to get close enough to use their jetpacks to slow down for the intercept.",
      "full_paragraph": "To help the assault teams, Skippy had performed\nwhat he considered a rather lame bit of magic. Using microwormholes he had very\ngently moved into position behind each dropship, he projected stealth fields\nthrough the event horizon and wrapped them around the sensor trailing behind\nthe dropships. With the sensors now unable to receive real photons from outside\nthe stealth field, Skippy fed false data to the sensors, data which showed only\nhappy views of utterly benign, empty space other than the rocks and ice the\nKristang expected. The beer can had wanted to try transmitting a virus down the\nsensor cable, to partially take control of the dropships that way, but Little\nJoey Bishop the Buzzkill Party Pooper had vetoed that no doubt cool but risky\nand unnecessary stunt. So, Skippy was bored while he waited for the assault\nteam to get close enough to use their jetpacks to slow down for the intercept.",
      "trigger": "",
      "tones": [
        "technobabble"
      ],
      "partner": "crew",
      "context_before": "“There has been no reaction from either dropship\nto your presence,” Skippy reported. “Your portable stealth fields are working\noptimally, you can thank me for the enhancements, by the way. Unless they move\nsuddenly, my masking of their sensor probe should conceal your approach.”\n“Acknowledged,” Giraud replied quietly and he\nheard Smythe do the same. Skippy had not been able to infiltrate and take\ncontrol of the dropships the way he had with the destroyer, but his magic was\nable to help significantly. With the dropships encased in surprisingly\neffective stealth fields, they each would be blind if not for a probe extending\nforward from the nose, and a sensor at the end of a stiff cable trailing\nbehind. Those tiny sensors were outside the stealth field, passively picking up\ndata from the surrounding space. The greatest danger of discovery for the\nassault team was if one of them had to maneuver suddenly to avoid a chunk of\nrock, even the cold gas thrusters used by the jetpacks might be detected if\nused close enough to the dropships. In the final approach, there was also a\nrisk of even typically crappy Kristang sensors noticing the spatial distortion created\nby the individual stealth fields of the assault team.",
      "context_after": "Giraud ran a status check on his suit, jetpack,\nweapons and other gear, then he did the same for the other three members of his\nteam, though he could see they had all run status checks. Then he concentrated\non examining what was known about his target, now that he was getting close\nenough for his suit’s sensors to directly pick up the extremely low-power\ndatalink through the microwormhole behind the dropship. At first, all seemed\nnormal, the target appeared to be a mostly ordinary Kristang model the Pirates\nreferred to as a Dragon-B. There were some pods attached under the stubby wings\nand one running along the top of the cabin, Giraud assumed they were part of\nthe enhanced stealth gear. Everything was as expected, and he saw no reason to\nmake even minor changes to the assault plan.",
      "paragraph_index": 44,
      "chapter_index": 31,
      "chapter_id": "text/part0000_split_033.html"
    },
    {
      "skippy_text": "“I see that,” Skippy replied eagerly. “Scratch\nthe word ‘appeared’, I can tell they \nare",
      "full_paragraph": "“I see that,” Skippy replied eagerly. “Scratch\nthe word ‘appeared’, I can tell they \nare",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "The interior of the cockpit instantly became a\nshambles, displays shattered, controls knocked offline, pilot and copilot killed\nas the soft tissue of their brains were smashed by the hammer blows of air\noverpressure. If the cockpit had windows, they would have been blown out. Weak\nspots in the inner pressure hull developed cracks and air briefly leaked out\nuntil the nano-filled liquid sealant between hull layers filled in the gaps.\nWith his boots now securely clamped to the hull\nabove the cockpit, Giraud and another French paratrooper attached a probe to\nthe lance they used to burn through the hull and inject the grenade. Pressing a\ntrigger on top shot the probe down the hollow lance, and instantly they had a\nview of the shattered cockpit. “Both pilots appear dead,” Giraud reported.",
      "context_after": "dead. Commence Phase Two.”",
      "paragraph_index": 85,
      "chapter_index": 31,
      "chapter_id": "text/part0000_split_033.html"
    },
    {
      "skippy_text": "“Don’t be so hasty, Renee,” Skippy snapped\npeevishly. “This is delicate work, I have to wriggle that probe around to plug\nit into-Ah, got it! Damn, it would have been a lot easier if some monkeys had\nnot gotten overeager with a concussion grenade, it almost crushed the access\nport I had to plug into.”",
      "full_paragraph": "“Don’t be so hasty, Renee,” Skippy snapped\npeevishly. “This is delicate work, I have to wriggle that probe around to plug\nit into-Ah, got it! Damn, it would have been a lot easier if some monkeys had\nnot gotten overeager with a concussion grenade, it almost crushed the access\nport I had to plug into.”",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "joe",
      "context_before": "Giraud gave the order and the other pair of\nsoldiers activated their own lance above the main cabin, where they expected\nthe Keepers to be. This second lance quickly burned through outer and inner\nhulls, injecting first a pair of long, thin flash-bang grenades to stun anyone\nin the cabin, then flooding the cabin with a fast-acting gas that had a\ntemporary paralyzing effect on the human nervous system. That gas was followed\nby an anesthetic to render the immobile victims unable to resist when the\nassault team came through the airlock.\n“Skippy, do you have control yet?” Giraud asked\nanxiously while the right side of his visor showed him a view of the main\ncabin. Nine Keepers were strapped into seats, inert but breathing shallowly.\nOne Keeper had acted quickly on his own initiative when the concussion grenade\ndetonated in the cockpit, he had unstrapped himself and now floated upside-down\nnear the roof of the cabin, his unconscious form bouncing off the ceiling. All\nten of the humans had tiny droplets of blood seeping from their ears, the\neffect of the flash-bang grenade magnified in the confined, airtight space.\nMajor Smythe had inquired whether they should modify the grenades to dial down\nthe effect, but Colonel Bishop had instantly vetoed that idea when Skippy\nstated he was confident no one would be permanently injured by the devices.\nBishop’s actual words had made even Giraud blush slightly, something like ‘F\nthose F-ing MFers I’d like to stuff an F-ing grenade in their F-ing pie holes,\nserves those F-ing F-heads right’. That got a big laugh from the beer can, who\nsuggested the Colonel should tell people how he \nreally\n felt.",
      "context_after": "“\nYou",
      "paragraph_index": 89,
      "chapter_index": 31,
      "chapter_id": "text/part0000_split_033.html"
    },
    {
      "skippy_text": "“Of course not,” Skippy retorted with a verbal\neyeroll. “I am opening the rear door and the outer door to the portside\nairlock. You need to detach from those bulky jetpacks and stealth generators. I\nam not moving this thing until your team is securely inside the cabin and those\nKeepers are prevented from causing any trouble.”",
      "full_paragraph": "“Of course not,” Skippy retorted with a verbal\neyeroll. “I am opening the rear door and the outer door to the portside\nairlock. You need to detach from those bulky jetpacks and stealth generators. I\nam not moving this thing until your team is securely inside the cabin and those\nKeepers are prevented from causing any trouble.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“Uh huh, so I shouldn’t mention that fact to\nSmythe?”\n“Well,” Giraud grinned, knowing Skippy could see\ninside his helmet. “You certainly should not withhold pertinent information\nfrom the mission commander.”",
      "context_after": "Giraud was first to enter the dropship’s cabin,\nwith another French paratrooper right behind him. As soon as the two cleared\nthe inner airlock door, it slid closed and the lock began pumping out air to\nlet the two other soldiers in. To prevent the four pirates from becoming\ninfected, they needed to remain sealed up in their armored suits, but the\ndropship could not move until all four were secured inside the cabin.",
      "paragraph_index": 96,
      "chapter_index": 31,
      "chapter_id": "text/part0000_split_033.html"
    },
    {
      "skippy_text": "“For realz?” Skippy asked sharply. “That wasn’t\nsome sort of Napoleon joke?”",
      "full_paragraph": "“For realz?” Skippy asked sharply. “That wasn’t\nsome sort of Napoleon joke?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“What? Never. Ah, not \nnever\n. I have control of the central sensor detection grids in this\nsystem, but there are isolated ships I was not able to infiltrate because the\nspeed of light is such a huge pain in the \nass\n.\nThose ships will report their findings to the fleet authorities on Paradise,\nand at that point, the code I wrote to suppress the sensor grid will have to\nerase itself and cause a wide-spread glitch in the system, or the hamsters will\nget suspicious. As it is, I expect a team of hamster code monkeys to be tearing\ntheir fur out for weeks trying to understand how such a serious glitch could\nhave happened,” he chuckled gleefully. “Hee hee, I am \nsuch\n an asshole sometimes. Anyway, you have plenty of time to get\nback to the \nDutchman\n, and for the\nship to jump safely away.”\n“You have thought of everything. You are truly\nthe Emperor of Excellence.”",
      "context_after": "“For real. And we French do not joke about\nNapoleon.”",
      "paragraph_index": 68,
      "chapter_index": 32,
      "chapter_id": "text/part0000_split_034.html"
    },
    {
      "skippy_text": "“Joe,” Skippy whispered in my ear, “that British\nguy is Lieutenant Nigel Green.”",
      "full_paragraph": "“Joe,” Skippy whispered in my ear, “that British\nguy is Lieutenant Nigel Green.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“One way or another, Gunny, they sure as hell\nare never telling the outside galaxy about our secret. And the fact that we are\nable to fly back to Earth will tell them that wormhole is not really dormant.”\n“Good point, Sir,” she acknowledged.",
      "context_after": "I enabled my helmet speakers again. “You’re\nNigel Green?” I asked. The guy nodded with a glance at Chisolm. None of them\nwere wearing nametags or were carrying any form of identification. “Your family\nback home is alive and well,” I recalled from the briefing packet Skippy\nprovided before the two dropships reached the \nFlying Dutchman\n. From facial recognition, the beer can knew the\nidentity of the Keepers, and he fed into my earpiece details about their\nfamilies and friends on Earth. “Your sister Susan had a baby boy she named\nTrevor after one of your grandfathers.”",
      "paragraph_index": 109,
      "chapter_index": 32,
      "chapter_id": "text/part0000_split_034.html"
    },
    {
      "skippy_text": "“Joe,” Skippy whispered in my ear again, “I have\nphotos of the baby, but photos can be faked. It doesn’t matter anyway, these people\nare true close-minded fanatics. Facts will not sway their minds because they\nare desperately clinging to their beliefs, it is the only thing they have left.\nYou have to appeal to them emotionally.”",
      "full_paragraph": "“Joe,” Skippy whispered in my ear again, “I have\nphotos of the baby, but photos can be faked. It doesn’t matter anyway, these people\nare true close-minded fanatics. Facts will not sway their minds because they\nare desperately clinging to their beliefs, it is the only thing they have left.\nYou have to appeal to them emotionally.”",
      "trigger": "I enabled my helmet speakers again. “You’re\nNigel Green?” I asked. The guy nodded with a glance at Chisolm. None of them\nwere wearing nametags or were carrying any form of identification. “Your family\nback home is alive and well,” I recalled from the briefing packet Skippy\nprovided before the two dropships reached the \nFlying Dutchman\n. From facial recognition, the beer can knew the\nidentity of the Keepers, and he fed into my earpiece details about their\nfamilies and friends on Earth. “Your sister Susan had a baby boy she named\nTrevor after one of your grandfathers.”",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "I enabled my helmet speakers again. “You’re\nNigel Green?” I asked. The guy nodded with a glance at Chisolm. None of them\nwere wearing nametags or were carrying any form of identification. “Your family\nback home is alive and well,” I recalled from the briefing packet Skippy\nprovided before the two dropships reached the \nFlying Dutchman\n. From facial recognition, the beer can knew the\nidentity of the Keepers, and he fed into my earpiece details about their\nfamilies and friends on Earth. “Your sister Susan had a baby boy she named\nTrevor after one of your grandfathers.”\n“He’s lying, Green,” Chisolm warned. “Don’t\nlisten to him. You don’t have any proof, do you?” He said that last while\nglaring at me.",
      "context_after": "“I know that, Skippy, and you’re wrong. I don’t \nhave\n to do anything for these idiots.”\nTurning my external speakers back on, I addressed Green first. “I do have\nproof, but you won’t believe it. The proof you \nwill\n believe is when you see your nephew for yourself. As our SEALS\nteam leader,” I jerked a thumb at Williams, “said, we are headed home.”\nStepping forward, I got close enough to Chisolm to touch him. To his credit, he\ndidn’t flinch though I was taller and encased in a mech suit. “There are over a\nhundred thousand humans stranded on Paradise. Loyal soldiers smartened up and\naccepted the cold reality that we got suckered and used by the Kristang, that\nwe were fighting on the wrong side of the war. No!” I exclaimed as Chisolm\nopened his mouth to protest. “You shut your mouth,” I followed that with a powered-armor\njab to his chest with an index finger. It knocked him back but only made him\nangry. “The loyal troops on Paradise are stuck there, while \nyou\n, you traitorous,\n dumb\n motherfuckers get to go home. \nYou\n are going home to Earth, \nyou",
      "paragraph_index": 112,
      "chapter_index": 32,
      "chapter_id": "text/part0000_split_034.html"
    },
    {
      "skippy_text": "“No? Then what-” Most of the time, my brain was\nannoyingly slow, just like Skippy said. This time, however, I got it right\naway. “Oh, shit. The problem isn’t gamma rays coming from Earth. The problem is\ngamma rays every time you reopen that wormhole that is supposed to be dormant.”",
      "full_paragraph": "“No? Then what-” Most of the time, my brain was\nannoyingly slow, just like Skippy said. This time, however, I got it right\naway. “Oh, shit. The problem isn’t gamma rays coming from Earth. The problem is\ngamma rays every time you reopen that wormhole that is supposed to be dormant.”",
      "trigger": "“Signals traveling from \nEarth\n are not the problem, dumdum,” Skippy chided me more gently\nthan he usually did when I said something stupid.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "first jumped into Earth orbit, so-”\n“Signals traveling from \nEarth\n are not the problem, dumdum,” Skippy chided me more gently\nthan he usually did when I said something stupid.",
      "context_after": "“\nEgg\n-zactly,\nJoe, very good! That time I was not belittling your intelligence, you caught on\nquickly. Hmmm, maybe being around me has smartened you up a bit. Yes, that\nElder wormhole is supposed to be shut down, but we have used it three times\nsince then. Outbound and return on our second mission. Plus outbound on this\ncurrent mission that has lasted way longer than anyone expected. We will be\nusing that wormhole again to get back to Earth, and outbound for our next\nmission. Whenever we use that mostly-dormant wormhole, I open it in a location\nfar away from its original programmed pattern. But someone is going to notice\ngamma rays coming from a wormhole that is supposed to be inactive. They are\ngoing to notice multiple gamma rays events, at odd intervals, and that is going\nto look very suspicious.”",
      "paragraph_index": 60,
      "chapter_index": 33,
      "chapter_id": "text/part0000_split_035.html"
    },
    {
      "skippy_text": "“As you would say, ‘\nAyuh\n’.” It did not sound right when Skippy said it, but I didn’t\nprotest. “The cure and the vaccine are the same mechanism. Well, mostly. The\nvaccine is part of the cure. The vaccine will prevent a person from becoming\ninfected, and it can stop an infected person’s DNA from making more of the\npathogen. The cure has a second element that latches onto one base component of\nthe prion, so it can never assemble into anything dangerous. After a while, my\nguess is four to six months, the base components will dissolve on their own.\nThe vaccine I developed for the Ruhar is much simpler, as the\ngenetically-enhanced biology of that species has a vastly superior immune\nresponse. All my vaccine does is allow the Ruhar version of DNA to create sort\nof antibodies to identify the pathogen components, and the hamster immune\nsystem will take care of the rest.”",
      "full_paragraph": "“As you would say, ‘\nAyuh\n’.” It did not sound right when Skippy said it, but I didn’t\nprotest. “The cure and the vaccine are the same mechanism. Well, mostly. The\nvaccine is part of the cure. The vaccine will prevent a person from becoming\ninfected, and it can stop an infected person’s DNA from making more of the\npathogen. The cure has a second element that latches onto one base component of\nthe prion, so it can never assemble into anything dangerous. After a while, my\nguess is four to six months, the base components will dissolve on their own.\nThe vaccine I developed for the Ruhar is much simpler, as the\ngenetically-enhanced biology of that species has a vastly superior immune\nresponse. All my vaccine does is allow the Ruhar version of DNA to create sort\nof antibodies to identify the pathogen components, and the hamster immune\nsystem will take care of the rest.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Joe, DNA is not just a bunch of colored balls\nconnected by sticks like in your high school science lab. It is a powerful\nchemical-based data storage system, quite efficient for its size. It is also a\nhandy factory for churning out organic chemicals, which is how the Kristang\nwere able to use modified DNA to create the prion base components. The cure I\nhave created is pure genius, even I am amazed by my awesomeness this time. This\ncure not only prevents the infected person’s DNA from replicating more of the\nbase components, it acts as a monitoring and repair mechanism for DNA, to\nprevent harmful mutations. To a limited extent, of course, if a person gets a\nbad dose of radiation, their DNA will be damaged beyond any self-repair\ncapability my cure can provide.”\n“Excellent! Outstanding! And a vaccine, too?”",
      "context_after": "“Skippy, this is truly awesome. When can you\nbegin testing?”",
      "paragraph_index": 25,
      "chapter_index": 34,
      "chapter_id": "text/part0000_split_036.html"
    },
    {
      "skippy_text": "“Bingo!\nGood news, Joe!” Skippy shouted excitedly over my zPhone while I was in the\ngym. At least he hadn’t interrupted me in the shower, so I counted that one in\nthe ‘W’ column.",
      "full_paragraph": "“Bingo!\nGood news, Joe!” Skippy shouted excitedly over my zPhone while I was in the\ngym. At least he hadn’t interrupted me in the shower, so I counted that one in\nthe ‘W’ column.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "The package contained extensive analysis, test\nresults and instructions how to manufacture the cure and vaccines for both\nhumans and Ruhar. Embedded in the package were subtle hints that miracle cure\nhad been provided by the Maxolhx, who were embarrassed and pissed off that\nclients under them had acted in such a rash manner that might blow back on the\nsenior species.\nThen, we had to wait and hope the Ruhar would\ntake action.",
      "context_after": "Carefully letting the bench-press bar settle\ninto the clamps, I sat up and pulled the phone off my belt. “You sound happy.\nDid you just think of a way to persuade Jimmy he is wrong about, uh, what was\nit?”",
      "paragraph_index": 47,
      "chapter_index": 34,
      "chapter_id": "text/part0000_split_036.html"
    }
  ]
}