{
  "book": "Critical Mass (Expeditionary Force #10) by Craig Alanson.epub",
  "stats": {
    "total_chapters": 38,
    "total_paragraphs": 7426,
    "skippy_entries": 82,
    "tone_distribution": {
      "neutral": 68,
      "insult": 8,
      "technobabble": 7,
      "sarcastic": 1
    },
    "partner_distribution": {
      "unknown": 48,
      "crew": 19,
      "joe": 11,
      "other_ai": 4
    }
  },
  "entries": [
    {
      "skippy_text": "The\ncombot swiveled, its legs remaining in place while the torso part of the\nchassis rotated. “It’s stuck,” Skippy said.",
      "full_paragraph": "The\ncombot swiveled, its legs remaining in place while the torso part of the\nchassis rotated. “It’s stuck,” Skippy said.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Can\nyou walk?”\nMy\nlegs hurt even worse than before, a sure sign that they weren’t as numb as\nbefore. Feeling was returning, so the nerves were sending signals from my legs\nto my brain. Were the nerves working in the other direction?” Moving my feet\nworked, better than when I tried it earlier. My calves dangled from my knees,\nswinging them proved my knees still worked. “I can try walking. Set me down.\nUh, turn this thing around first.”",
      "context_after": "“Yeah,\nhold it there,” I slid off the arms, first onto my knees. Sharp pieces of\nshattered wall debris cut into my bare knees and I felt hot blood trickle onto\nthe floor. “Swing it back around forward.” Using the robotic war machine as a\nwalker, I pulled myself up onto surprisingly steady legs. Steady, until I tried\nto take a step and fell.",
      "paragraph_index": 199,
      "chapter_index": 5,
      "chapter_id": "Text/part0000_split_007.html"
    },
    {
      "skippy_text": "Shaking\nmy head, I ran with lurching steps in the direction Skippy suggested. Again, he\nwas right. A dead Kristang was sprawled in the ground, with blast damage that I\nguessed was from the same impact that flattened three buildings to my left. To\nmy disappointment, the dead lizard did not have a rifle or any other type of\nweapon, except for a small knife. He also had a phone just as Skippy promised.\nThe knife went into a pocket and I cupped a hand over the phone. “Skippy, you\nthere?’",
      "full_paragraph": "Shaking\nmy head, I ran with lurching steps in the direction Skippy suggested. Again, he\nwas right. A dead Kristang was sprawled in the ground, with blast damage that I\nguessed was from the same impact that flattened three buildings to my left. To\nmy disappointment, the dead lizard did not have a rifle or any other type of\nweapon, except for a small knife. He also had a phone just as Skippy promised.\nThe knife went into a pocket and I cupped a hand over the phone. “Skippy, you\nthere?’",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "Looking\nat the sight made me pause, even knowing I had to move. Not that long ago,\nhumans could look at the night sky and wonder what was out there. Now we knew.\nIgnorance\nis bliss.",
      "context_after": "“Yes,\nJoe. You need to run! Those three soldiers who were away from the base on leave\nare back. They have acquired weapons and are coming in your direction, fast.”",
      "paragraph_index": 89,
      "chapter_index": 6,
      "chapter_id": "Text/part0000_split_008.html"
    },
    {
      "skippy_text": "“You’re\nclear, Joe,” Skippy whispered. “As far as I can tell, of course.”",
      "full_paragraph": "“You’re\nclear, Joe,” Skippy whispered. “As far as I can tell, of course.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Hold\nyour phone up, and be quiet,” he instructed.\nDoing\nwhat he requested, I stilled my breathing. Without any sensor coverage in the\nforest, the only way to detect whether I was being followed was to track\nsignals from the enemy, or to listen for movement. Skippy had reported one of\nthe three soldiers went dark about forty minutes before, turning off his comm\ngear. He had no way to track that lizard, other than listening to the other two\nlizards. So far, they had not talked about the third guy, so he could be\nanywhere, and that was not good for me. What was most troubling was that silent\nguy apparently was concerned about someone listening to his comms, so that\nlizard must have suspected they were not tracking only one unarmed human.",
      "context_after": "“Yeah.\nYou know of a good place around here for me to rest a bit?”",
      "paragraph_index": 6,
      "chapter_index": 7,
      "chapter_id": "Text/part0000_split_009.html"
    },
    {
      "skippy_text": "“How\nis it, Joe?” Skippy asked.",
      "full_paragraph": "“How\nis it, Joe?” Skippy asked.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "The\nnext item was something \nsquishy\n so I didn’t bother\nopening it. I got lucky by finding a real pack of crackers with the third try.\nThey were stale, of course. I wolfed them down, using the package as a cup to\ngulp water from the creek. The water was running steadily and looked clear, as\nmuch as I could tell at night. For all I knew, there was a dead native animal\njust upstream and I should have boiled the water, or run it through a filter,\nor used purification tablets but guess what? I didn’t have a filter or tablets,\nand couldn’t risk starting a fire. It was unlikely that the local\nmicroorganisms could make me sick in the short term anyway, and I wasn’t going\nfar if I didn’t drink plenty of water.\nA\nsniff check of the next item gave me a whiff of chocolate, and it was in powder\nform. Had to be cocoa powder, I had drunk plenty of that stuff in the Army.\nPouring water into the packet, I massaged it to break up most of the lumps. The\nfirst sip confirmed it was hot cocoa. Or, it was supposed to be served hot, and\nit was supposed to be cocoa with powdered milk. Hot cocoa should taste\nwonderful. It should taste like playing outside in the snow until you can’t\nfeel the tip of your nose, and your shoelaces are frozen together. You come\ninto the house where it is blessedly warm, and after wrenching your boots off\nso your mother doesn’t yell at you for tracking snow all over the floor, you\nsit down in front of the woodstove, where your mother brings you a hot mug of\ncocoa with a big scoop of marshmallow Fluff on top, and you sip it as feeling slowly\nreturns to the tip of your nose. That is what cocoa is supposed to taste like.",
      "context_after": "My\ntongue was trying to crawl out of my mouth to get away from the chalky, acrid\ntaste of expired cocoa powder partially dissolved in cold water. “\nIth",
      "paragraph_index": 12,
      "chapter_index": 7,
      "chapter_id": "Text/part0000_split_009.html"
    },
    {
      "skippy_text": "“Uh\noh, Joe,” Skippy whispered from the phone in my pocket. The sound was turned\ndown low, in case the lizards tracking me were using acoustic sensors. My borrowed\nphone was not in great shape, its screen was cracked and crazed from the blast\nthat had killed its previous owner. Without an earpiece for the stupid thing, I\nhad to put it to my ear to hear him clearly.",
      "full_paragraph": "“Uh\noh, Joe,” Skippy whispered from the phone in my pocket. The sound was turned\ndown low, in case the lizards tracking me were using acoustic sensors. My borrowed\nphone was not in great shape, its screen was cracked and crazed from the blast\nthat had killed its previous owner. Without an earpiece for the stupid thing, I\nhad to put it to my ear to hear him clearly.",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "crew",
      "context_before": "“My\nfear was not for myself. The entire time I was unable to communicate, I feared\nthat my failures would result in harm to the crew, and the people rescued from\nRikers.”\n“All\nI can say is, you did great in a bad situation. The Merry Band of Pirates is\nfond of saying that ‘Shit happens’. It’s inevitable that something will go\nwrong out here. What matters is how you deal with it. Uh, hey, when you start\nreactivating bots, give us a warning first? Those things are scary.”",
      "context_after": "“What\nis it, Skippy?”",
      "paragraph_index": 185,
      "chapter_index": 7,
      "chapter_id": "Text/part0000_split_009.html"
    },
    {
      "skippy_text": "“Joe,\nI do not have any advice for you,” Skippy whispered through the phone in my\npocket. “Wait, that’s not true.”",
      "full_paragraph": "“Joe,\nI do not have any advice for you,” Skippy whispered through the phone in my\npocket. “Wait, that’s not true.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“I’m\ndoing the best I can, Joe,” he sounded as tired and miserable as I felt. The\ndifference was, he wasn’t surviving on nutritionally-suspect freeze-dried food\npackets.\n“Fine.\nI appreciate it. Talk to you again when I get to the stream, OK?”",
      "context_after": "Holding\nonto a vine that kept me from plunging to my death, I paused for his nugget of\nwisdom. “What is your advice?”",
      "paragraph_index": 197,
      "chapter_index": 7,
      "chapter_id": "Text/part0000_split_009.html"
    },
    {
      "skippy_text": "that\n certainly could not have been my fault,” Skippy grumbled.",
      "full_paragraph": "that\n certainly could not have been my fault,” Skippy grumbled.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Mistakes-”\nSimms clenched her fists and regained control of herself. “\nValkyrie\n and\nthe \nDutchman\n were nearly destroyed, you-”\n“Well,",
      "context_after": "“It\nwas \nabsolutely\n your fault,” Nagatha snapped. “You failed-”",
      "paragraph_index": 36,
      "chapter_index": 9,
      "chapter_id": "Text/part0000_split_011.html"
    },
    {
      "skippy_text": "“Hey!”\nSkippy shouted. “Could this meeting of the We Hate Skippy Club adjourn for the\nmoment?”",
      "full_paragraph": "“Hey!”\nSkippy shouted. “Could this meeting of the We Hate Skippy Club adjourn for the\nmoment?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "other_ai",
      "context_before": "that\n certainly could not have been my fault,” Skippy grumbled.\n“It\nwas \nabsolutely\n your fault,” Nagatha snapped. “You failed-”",
      "context_after": "Chang\nclenched his teeth. He needed to focus. “Agreed. What is Bishop’s status?”",
      "paragraph_index": 38,
      "chapter_index": 9,
      "chapter_id": "Text/part0000_split_011.html"
    },
    {
      "skippy_text": "“Joe\ndied as he lived,” Skippy sighed. “Stupidly.”",
      "full_paragraph": "“Joe\ndied as he lived,” Skippy sighed. “Stupidly.”",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "joe",
      "context_before": "“Hey!”\nSkippy shouted. “Could this meeting of the We Hate Skippy Club adjourn for the\nmoment?”\nChang\nclenched his teeth. He needed to focus. “Agreed. What is Bishop’s status?”",
      "context_after": "“Bishop\nis \ndead\n?”",
      "paragraph_index": 40,
      "chapter_index": 9,
      "chapter_id": "Text/part0000_split_011.html"
    },
    {
      "skippy_text": "“Joe\ngot a \nNo\n-Hawk,” Skippy announced with a giggle. “Soon that fashion will\nbe all the rage, or that’s what he thinks.”",
      "full_paragraph": "“Joe\ngot a \nNo\n-Hawk,” Skippy announced with a giggle. “Soon that fashion will\nbe all the rage, or that’s what he thinks.”",
      "trigger": "“What’s\nso funny, Staff Sergeant?” I asked as Fabron glared at her.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "I\nsaw what she meant. Not my dirty, scarred, bruised and scalded skin. Not the\nblood-shot eyes. Not how gaunt and pasty I looked. What she found amusing was\nthat I was missing a stripe of hair in the middle of my head, front to back.\nThe hair on both sides was shaggy, but in the middle was only a faint stubble.\n“Yeah,” was all I could say.\n“That,\nuh,” her shoulders were shaking, and even Fabron had to look away so he didn’t\nburst out laughing. “That is an, \ninteresting \nhairstyle, Sir.”",
      "context_after": "“It’s,\nuh,” she took a photo of me and handed me the phone.",
      "paragraph_index": 233,
      "chapter_index": 9,
      "chapter_id": "Text/part0000_split_011.html"
    },
    {
      "skippy_text": "“It\nis a concern,” Skippy said, with no trace of his usual snarkiness. “The\nThuranin were not gentle with him, and the countermeasures I used made it\nworse. Right now, he needs rest. Oh, Joe,” he sighed. “I’m sorry. I am truly\nsorry.”",
      "full_paragraph": "“It\nis a concern,” Skippy said, with no trace of his usual snarkiness. “The\nThuranin were not gentle with him, and the countermeasures I used made it\nworse. Right now, he needs rest. Oh, Joe,” he sighed. “I’m sorry. I am truly\nsorry.”",
      "trigger": "",
      "tones": [
        "sarcastic"
      ],
      "partner": "unknown",
      "context_before": "“How\nis he?” Fabron asked quietly.\nRaven\nglanced again at the medical scanner. “Malnutrition, like he said. A low-grade\nfever. He is beginning to get \nscurvy\n,\n I haven’t\nseen that except in textbooks. The burns are second-degree, they will heal. What\nI don’t understand is the result of the brain scan. This thing,” she waved the\nscanner, “isn’t super accurate for that type of analysis, but he has lesions on\nhis brain. This is not good news.”",
      "context_after": "",
      "paragraph_index": 242,
      "chapter_index": 9,
      "chapter_id": "Text/part0000_split_011.html"
    },
    {
      "skippy_text": "“Good\nstrategy,” Skippy said. “My estimate is he only has thirty-eight rounds in that\nmagazine. Plus another sixty-two rounds in the spare magazine he is probably\ncarrying. Unless he brought more magazines with him, you know.”",
      "full_paragraph": "“Good\nstrategy,” Skippy said. “My estimate is he only has thirty-eight rounds in that\nmagazine. Plus another sixty-two rounds in the spare magazine he is probably\ncarrying. Unless he brought more magazines with him, you know.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“But,”\nshe protested, struggling to her feet. “I can-”\n“Hold\nyour position. Team Alpha, we need to take this one \nalive\n. Let him\nexpend all his ammo, then we move in.”",
      "context_after": "“Bloody\nwonderful,” Smythe muttered under his breath. “Do you have any more good news\nfor us?”",
      "paragraph_index": 83,
      "chapter_index": 10,
      "chapter_id": "Text/part0000_split_012.html"
    },
    {
      "skippy_text": "“Not\nnecessarily,” Skippy announced cheerily.",
      "full_paragraph": "“Not\nnecessarily,” Skippy announced cheerily.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "implants.”\nSmythe\nknew the enemy must have thought the bouncing and crashing of the stone was a\nsoldier approaching, and took his own life. The pride of the Thuranin did not\nallow for capture by inferior beings. Smythe let fly a creative string of expletives\nwith his helmet microphone switched off. Then, “That’s it, then, we buggered\nthat.”",
      "context_after": "“We\nwere supposed to take them \nalive\n,” Smythe protested. “We failed.”",
      "paragraph_index": 108,
      "chapter_index": 10,
      "chapter_id": "Text/part0000_split_012.html"
    },
    {
      "skippy_text": "is dead,” Skippy snorted. “Quick, one of you go through her pockets for loose\nchange, while somebody else cuts her head off.”",
      "full_paragraph": "is dead,” Skippy snorted. “Quick, one of you go through her pockets for loose\nchange, while somebody else cuts her head off.”",
      "trigger": "“That’s\nwhat I said. Fortunately for you, Miracle Max is on the job. I advise you to\nget back to Target Bravo, and hurry.”",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“He\nlooks dead to me,” Smythe crouched by the small, broken form, trapped under the\nejection seat.\n“\nShe",
      "context_after": "Jeremy\nSmythe, a battle-hardened veteran, flinched. “Cut her head off? Skippy, we do\nnot desecrate the bodies of-”",
      "paragraph_index": 117,
      "chapter_index": 10,
      "chapter_id": "Text/part0000_split_012.html"
    },
    {
      "skippy_text": "If it had been my decision, I would have sent\npeople aboard \nValkyrie\n with Skippy, but Chang made the call and I didn’t\nhave a problem with it. The fact was, I was unfit for command. Physically, I\nwas worn out. Skippy warned that I actually had sustained minor brain damage,\nboth from the quachines and from the tender loving care of the Thuranin. When\nhe told me that, he hadn’t made a joke about the brain damage being no worse\nthan usual, so I knew it was serious. He promised the damage could be repaired,\nboth with treatment and by my brain healing itself, if I got rest and stayed\naway from stressful situations.",
      "full_paragraph": "If it had been my decision, I would have sent\npeople aboard \nValkyrie\n with Skippy, but Chang made the call and I didn’t\nhave a problem with it. The fact was, I was unfit for command. Physically, I\nwas worn out. Skippy warned that I actually had sustained minor brain damage,\nboth from the quachines and from the tender loving care of the Thuranin. When\nhe told me that, he hadn’t made a joke about the brain damage being no worse\nthan usual, so I knew it was serious. He promised the damage could be repaired,\nboth with treatment and by my brain healing itself, if I got rest and stayed\naway from stressful situations.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "Another\nthing I did, during the brief times I was awake, was play the cognitive therapy\nvideo game Skippy designed for me. The graphics were of course phenomenal, but the\nrest of the game was a frustrating \nsuckfest\n. Good for\nme that I slept most of the time.\nAnyway,\nSkippy got \nValkyrie’s\n power back on and major systems stable within\nforty-two hours, working as fast as he could so Simms could come aboard with\nher full team. He was lonely being all by himself, so that was extra incentive\nto get the work done.",
      "context_after": "Like",
      "paragraph_index": 112,
      "chapter_index": 11,
      "chapter_id": "Text/part0000_split_013.html"
    },
    {
      "skippy_text": "Going\nwith Simms was partly for me and partly for Chang. He didn’t need me hanging\naround, potentially second-guessing every decision he made. Plus, I was\noccupying a cabin on an over-crowded ship. Plus, Skippy suggested the medical\nfacilities aboard \nValkyrie\n were better suited to assist my recovery.\nPlus, I didn’t want to meet the people we rescued, until I no longer looked\nlike a zombie.",
      "full_paragraph": "Going\nwith Simms was partly for me and partly for Chang. He didn’t need me hanging\naround, potentially second-guessing every decision he made. Plus, I was\noccupying a cabin on an over-crowded ship. Plus, Skippy suggested the medical\nfacilities aboard \nValkyrie\n were better suited to assist my recovery.\nPlus, I didn’t want to meet the people we rescued, until I no longer looked\nlike a zombie.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "back\n so our two ships were only seventeen kilometers apart,\nand Simms took her crew back aboard.\nWith\nme.",
      "context_after": "Plus\n, if you want the truth, if I remained aboard the \nDutchman\n,\nI might run into Adams. That was awkwardness neither of us needed right then.",
      "paragraph_index": 124,
      "chapter_index": 11,
      "chapter_id": "Text/part0000_split_013.html"
    },
    {
      "skippy_text": "A\nbig part of my recovery was physical therapy. Mad Doctor Skippy insisted that I\ndrag my sorry ass out of bed to work on exercises to improve my eye-hand coordination,\nto help my injured calf muscle heal properly, and to perform fun brain-teaser\ngames. The brain games were not actually fun, they were hard. Skippy said they\nwere important, to compensate for the damage the Thuranin and quachines had\ndone inside my skull.",
      "full_paragraph": "A\nbig part of my recovery was physical therapy. Mad Doctor Skippy insisted that I\ndrag my sorry ass out of bed to work on exercises to improve my eye-hand coordination,\nto help my injured calf muscle heal properly, and to perform fun brain-teaser\ngames. The brain games were not actually fun, they were hard. Skippy said they\nwere important, to compensate for the damage the Thuranin and quachines had\ndone inside my skull.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“Sir,”\nhe stood up. “If you had a defeatist attitude like that on \nmy\n team, you\nwould be performing incentive training until you either passed out or\nstraightened up. We need you to \nstraighten up\n.”\nI\ngot the message. What I could do about it, I didn’t know. But I was going to do\nsomething about it. I began with a nap. Talking with Smythe had worn me out,\nand whatever I did next, I needed to fix my stupid brain first.",
      "context_after": "When\nI arrived for my first therapy session, Staff Sergeant Grudzien was wrapping up\nhis own physical therapy, for the injuries he sustained during the raid on\nRikers. “Colonel Bishop,” he greeted me. “Good to have you back aboard, Sir. I\nwish I had been on the retrieval team.”",
      "paragraph_index": 57,
      "chapter_index": 12,
      "chapter_id": "Text/part0000_split_014.html"
    },
    {
      "skippy_text": "“Come\non, Joe, that’s not true,” Skippy scoffed.",
      "full_paragraph": "“Come\non, Joe, that’s not true,” Skippy scoffed.",
      "trigger": "“I’ll\ntalk to your team when I can,” I said over a yawn.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "It\nsucked. The truth was, the last time I had someone to really talk with was before\nI got promoted to sergeant, way back on Camp Alpha. Cornpone and Ski and I, we\nwould tell each other everything. I missed that.\nWhat\nI really wanted was a woman to talk with. “I’m going to be alone \nforever\n,”\nI moaned as I slumped back on the table.",
      "context_after": "“Thanks\nfor the vote of confidence. That’s nice to-”",
      "paragraph_index": 86,
      "chapter_index": 12,
      "chapter_id": "Text/part0000_split_014.html"
    },
    {
      "skippy_text": "“Uh,\nwhy, Joe?” Skippy asked quietly.",
      "full_paragraph": "“Uh,\nwhy, Joe?” Skippy asked quietly.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“\nShit\n!”\nEighty-three light-minutes was a long distance, even in space combat. Light\ntravels eighteen \nmillion\n kilometers per minute. So, those recon ships\nwere about one and a half billion kilometers away. That was plenty of space\nbetween us and the enemy, except for the fact that a starship could jump across\nthat distance in the blink of an eye. For all we knew, those three warships had\njust jumped in three light-seconds away, and we wouldn’t know it until the\ngamma rays reached us.\nThe\nknives got tossed into a bin and I secured the lid, so they wouldn’t fly around\nand become dangerous knife-missiles if \nValkyrie\n went into combat. The flank\nsteak I wrapped back in waxed paper and put in the fridge. Pulling off the\napron, I quickly washed my hands. “Tell Simms I’ll be on the bridge ASAP.”",
      "context_after": "“Duh,\nbecause- Shit.” He was right. My duty station was not on the bridge. It was in\nthe galley. Or, during a fight, I was supposed to be in the ship’s medical bay,\nto assist anyone injured.",
      "paragraph_index": 13,
      "chapter_index": 13,
      "chapter_id": "Text/part0000_split_015.html"
    },
    {
      "skippy_text": "“It’s\npossible,” Skippy replied with a maddening lack of commitment. “We can see \nthem\n,\neven without the gamma rays and active pings. Of course, we have better\nsensors, even without my considerable-”",
      "full_paragraph": "“It’s\npossible,” Skippy replied with a maddening lack of commitment. “We can see \nthem\n,\neven without the gamma rays and active pings. Of course, we have better\nsensors, even without my considerable-”",
      "trigger": "“Ok,\nKong,” I remained standing to the right of Simms. All the bridge stations were\noccupied, and I wasn’t assigned there. “Two frigates and a destroyer one point\nfive billion klicks away,” I said to let him know what little I knew.",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“That’s\nabout all we have now,” Simms reported. “The frigates started pinging with\nactive sensors thirty-seven seconds ago.”\n“Skippy,”\nChang asked. “Can they detect us from there?”",
      "context_after": "Unlike\nme, Chang had no patience for bragging. “Confidence?”",
      "paragraph_index": 27,
      "chapter_index": 13,
      "chapter_id": "Text/part0000_split_015.html"
    },
    {
      "skippy_text": "“No,\nJoe,” Skippy said gently, which meant he was being kind. He was humoring me.\nBecause I was the poor, traumatized, brain-damaged fool, babbling nonsense.\n“All of the \nDutchman’s\n docking hardpoints have been removed. Constructing\na mechanism to attach the two ships, without snapping the \nDutchman’s",
      "full_paragraph": "“No,\nJoe,” Skippy said gently, which meant he was being kind. He was humoring me.\nBecause I was the poor, traumatized, brain-damaged fool, babbling nonsense.\n“All of the \nDutchman’s\n docking hardpoints have been removed. Constructing\na mechanism to attach the two ships, without snapping the \nDutchman’s",
      "trigger": "“Yeah,\nsorry about that,” Skippy mumbled. “Not for another seventeen hours. Like I\nsaid, realigning \nValkyrie’s\n jump drive is a very delicate process. Getting\na bank of coils calibrated requires me to rebuild some of the components up\natom by atom. Maybe I could cut three hours of the process, if we want to cut\ncorners.”",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“What\ndo you think?” Chang was asking me and Simms.\n“Uh,”\nstupidly, I assumed he expected me to solve the problem. “The \nFlying\nDutchman\n was a star carrier, right? Can we piggyback \nValkyrie\n on the\nframe, have the \nDutchman\n jump us away from here?”",
      "context_after": "spine, would take longer than repairing \nValkyrie’s\n drive.”",
      "paragraph_index": 37,
      "chapter_index": 13,
      "chapter_id": "Text/part0000_split_015.html"
    },
    {
      "skippy_text": "“Much\nas I would love to give the Thuranin a good ass-kicking,” Skippy grumbled. “I\nhad better stay here. Without my normal full range of, um, special abilities, I\nwould not be much use in combat. Nagatha is certainly capable of handling the \nDutchman\n.”",
      "full_paragraph": "“Much\nas I would love to give the Thuranin a good ass-kicking,” Skippy grumbled. “I\nhad better stay here. Without my normal full range of, um, special abilities, I\nwould not be much use in combat. Nagatha is certainly capable of handling the \nDutchman\n.”",
      "trigger": "I\nhesitated to speak, fearing whatever I said would sound stupid. “Kong, should you\ntake Skippy with you, in case you run into trouble?”",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "His\neyes flicked to Simms before he answered. Part of that was probably to gauge\nhow she felt about keeping Skippy aboard our disabled battlecruiser. “Thank you\nfor the offer, Joe. At this time, I believe Skippy should focus on restoring \nValkyrie’s\njump capability.”",
      "context_after": "“I agree,”\nChang said. “We can only delay the Thuranin. It is imperative that \nValkyrie",
      "paragraph_index": 59,
      "chapter_index": 13,
      "chapter_id": "Text/part0000_split_015.html"
    },
    {
      "skippy_text": "“There\nis as yet no indication they detect us,” Skippy answered. “The ship has not\noriented its sensor array in this direction.”",
      "full_paragraph": "“There\nis as yet no indication they detect us,” Skippy answered. “The ship has not\noriented its sensor array in this direction.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“That\nship is just sitting there,” Simms pointed to the image highlighted in the\nholographic display. “Hasn’t engaged active sensors yet.”\n“Do\nthey see us?” I directed that question to Skippy, as I slowly logged myself\ninto the sensor console, typing with one finger and still screwing up.",
      "context_after": "“We’re\nunder strict EMCOM Alpha,” Simms reminded me. Since we picked up gamma rays\nfrom the first three ships, \nValkyrie\n had gone dark. No electronic emissions,\nand the radiators that cooled the reactors were shut off. Internal heatsinks\nwere absorbing the excess energy, which could not last forever. The point was,\nthe ship was not radiating a significant level of photons, and being so far\nfrom the local star, the ship’s dull gray armor plating would be difficult to\nsee. If the enemy were closer, they might detect us from the way the\nbattlecruiser’s substantial mass created a dent in spacetime, but no way could\na Thuranin ship detect that from sixteen light-minutes away. That was twice the\ndistance from Earth to the Sun.",
      "paragraph_index": 145,
      "chapter_index": 13,
      "chapter_id": "Text/part0000_split_015.html"
    },
    {
      "skippy_text": "“Regrettably,\nyes.” Skippy said. “I haven’t been able to realign the-”",
      "full_paragraph": "“Regrettably,\nyes.” Skippy said. “I haven’t been able to realign the-”",
      "trigger": "sensor suite was controlled by Skippy, so the data did come from him. “Sixty-eight\npercent probability of a solid return,” I said, before catching a look from\nSimms. Duh. She hadn’t called me to the bridge to read data from a console. She\nwanted my advice, my experience, my insight. My \nhelp\n in a crisis. “Chang\nsaid the best defense is a good offense,” I reminded her gently.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Confirmed,”\nSkippy agreed. “It is \nnot\n one of the two frigates with the destroyer,\nthat the \nDutchman\n has targeted. The jump signature is distinctive, this\nship is a different type of frigate. Another active ping just swept over us. Between\nthe two, that frigate has a seventy-four percent probability of determining our\nlocation within half a kilometer. We have seventeen, maybe eighteen minutes\nbefore the enemy receives and processes the sensor data, and jumps to\nintercept.”\n“Open\nmissile launch tubes,” Simms ordered. “Skippy, I want us in a launch-on-warning\nposture.” That was different from the launch-on-confirmation posture that was\nstandard procedure. She was willing to shoot at anything that looked dangerous,\neven a sensor glitch. “Our directed-energy weapons are still offline?” She\nasked hopefully.",
      "context_after": "“Understood.\nIf you redirect resources from the jump drive to maser cannons, could you bring\nthem-”",
      "paragraph_index": 154,
      "chapter_index": 13,
      "chapter_id": "Text/part0000_split_015.html"
    },
    {
      "skippy_text": "“Where\ndid it go?” I asked Skippy, breaking protocol. Simms was in \ncommand,",
      "full_paragraph": "“Where\ndid it go?” I asked Skippy, breaking protocol. Simms was in \ncommand,",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "The\nfrigate jumped away before the first missile got within forty thousand\nkilometers. That enemy ship reappeared, zero point three light-seconds on the\nother side of \nValkyrie\n. This time, the enemy fired masers and railguns,\nand hung around long enough to see those weapons strike our unprotected hull.\nThen\nit vanished.",
      "context_after": "I should have remained quiet.",
      "paragraph_index": 6,
      "chapter_index": 14,
      "chapter_id": "Text/part0000_split_016.html"
    },
    {
      "skippy_text": "“Analyzing\nthe outbound jump wormhole,” Skippy muttered, concentrating intensely. “The\nenemy dropped off two distortion devices to confuse our tracking. Interesting.\nThere is a seventy-one percent probability that ship jumped back into the local\nstar system.”",
      "full_paragraph": "“Analyzing\nthe outbound jump wormhole,” Skippy muttered, concentrating intensely. “The\nenemy dropped off two distortion devices to confuse our tracking. Interesting.\nThere is a seventy-one percent probability that ship jumped back into the local\nstar system.”",
      "trigger": "“Where\ndid it go?” I asked Skippy, breaking protocol. Simms was in \ncommand,",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Where\ndid it go?” I asked Skippy, breaking protocol. Simms was in \ncommand,\nI should have remained quiet.",
      "context_after": "Ray\nturned in the pilot seat to look at Simms. “That ship didn’t run away from us.”",
      "paragraph_index": 8,
      "chapter_index": 14,
      "chapter_id": "Text/part0000_split_016.html"
    },
    {
      "skippy_text": "“We\nwould need a lot of missiles,” Skippy warned. “Even if we emptied our magazines,\nwe could only cover-”",
      "full_paragraph": "“We\nwould need a lot of missiles,” Skippy warned. “Even if we emptied our magazines,\nwe could only cover-”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "Simms\nknew what our chief pilot was thinking. “If we get lucky, we hit a couple of enemy\nships, make them jump away to a safe distance?”\n“It\ncould buy time,” Reed shrugged. “I can’t think of anything else we can do,” she\nadded with a gesture at the pilot console in front of her.",
      "context_after": "Simms\nwas warming up to the idea. “We will launch decoys also,” she decided. “The\nenemy won’t have time to determine which sensor blips are missiles and which\nare decoys. Skippy, prep the magazines for rapid reload and-”",
      "paragraph_index": 38,
      "chapter_index": 14,
      "chapter_id": "Text/part0000_split_016.html"
    },
    {
      "skippy_text": "“Jeez,\nthis is interesting,” Skippy muttered. “Huh. I never thought of doing something\nlike that. Using a wormhole to move the endpoint of \nanother\n wormhole. \nThat\n has never been done before. Probably\nbecause it is \nso\n freakin’ crazy, no one ever-”",
      "full_paragraph": "“Jeez,\nthis is interesting,” Skippy muttered. “Huh. I never thought of doing something\nlike that. Using a wormhole to move the endpoint of \nanother\n wormhole. \nThat\n has never been done before. Probably\nbecause it is \nso\n freakin’ crazy, no one ever-”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "No\n, you moron. If you knew anything about hyperspatial physics, you- Um,\nhmm. Well. Gosh. Um, shmaybe?”\nSimms\nstared at \nme,\n eyes wide with hope.",
      "context_after": "“Skippy!”\nSimms got his attention as the deck rocked again, hard. The main display showed\none section of armor on the ship’s nose was close to a hull breach, and several\nthrusters were offline. “Whatever you gotta do, do it \nnow\n.”",
      "paragraph_index": 68,
      "chapter_index": 14,
      "chapter_id": "Text/part0000_split_016.html"
    },
    {
      "skippy_text": "“\nHey\n!”\nSkippy shouted. “I should-”",
      "full_paragraph": "“\nHey\n!”\nSkippy shouted. “I should-”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“I\nam pleased to meet you, I guess. Skippy told me-”\n“Skippy?\nSkippy \nsucks\n, man. He’s so old, like, \nold\n, you know? He-”",
      "context_after": "“Skippy!\nBe quiet, please. Bilby and I are talking.”",
      "paragraph_index": 140,
      "chapter_index": 15,
      "chapter_id": "Text/part0000_split_017.html"
    },
    {
      "skippy_text": "Skippy\nwas annoyed at having to fix the jump drive \nagain\n. His grumbling this\ntime was less than usual since, the first time he complained about it, I\nreminded him that the whole mess we were in was all his own stupid fault. He\nwas annoyed at having to do the work, frustrated at how long it would take, and\ntotally confident he could do it. “The Universe seriously tried to wreck our\nentire set of drive coils during that jump. It did not realize it was messing\nwith Skippy the \nMagnificent\n, I can tell you that,” he had grumbled, and\ngone back to doing whatever he was doing.",
      "full_paragraph": "Skippy\nwas annoyed at having to fix the jump drive \nagain\n. His grumbling this\ntime was less than usual since, the first time he complained about it, I\nreminded him that the whole mess we were in was all his own stupid fault. He\nwas annoyed at having to do the work, frustrated at how long it would take, and\ntotally confident he could do it. “The Universe seriously tried to wreck our\nentire set of drive coils during that jump. It did not realize it was messing\nwith Skippy the \nMagnificent\n, I can tell you that,” he had grumbled, and\ngone back to doing whatever he was doing.",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "unknown",
      "context_before": "CHAPTER SIXTEEN",
      "context_after": "While\nhe was working and bitching about it, I decided it was time for me to do\nsomething I had been dreading.",
      "paragraph_index": 1,
      "chapter_index": 16,
      "chapter_id": "Text/part0000_split_018.html"
    },
    {
      "skippy_text": "“Yes,”\nSkippy said in a very quiet voice.",
      "full_paragraph": "“Yes,”\nSkippy said in a very quiet voice.",
      "trigger": "Taking\na step forward, she loomed over him, and I swear to God, his avatar \nflinched\n.\n“Do you understand what I said?” She asked slowly.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“But-”\nTaking\na step forward, she loomed over him, and I swear to God, his avatar \nflinched\n.\n“Do you understand what I said?” She asked slowly.",
      "context_after": "“Yes,",
      "paragraph_index": 115,
      "chapter_index": 16,
      "chapter_id": "Text/part0000_split_018.html"
    },
    {
      "skippy_text": "“Hey,\nJoe,” Skippy said cheerily as his avatar shimmered to life on the desk in my\ncabin, interrupting a video game I was playing. It was not the ‘\nheeeeey\n Joe’ that sets off my Spidey senses, nor the quick\n‘hey Joe’ he used when he knew he was in trouble. This was just a friendly\ngreeting.",
      "full_paragraph": "“Hey,\nJoe,” Skippy said cheerily as his avatar shimmered to life on the desk in my\ncabin, interrupting a video game I was playing. It was not the ‘\nheeeeey\n Joe’ that sets off my Spidey senses, nor the quick\n‘hey Joe’ he used when he knew he was in trouble. This was just a friendly\ngreeting.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“I’ll\nthink about it. I won’t do anything without talking with you first. We need-”\nTwo\npeople came into the galley, and I stood up, draining my coffee cup. “Talk with\nyou later, XO.”",
      "context_after": "Instantly,\nI wondered what he was up to. “Hi, Skippy. What’s up?”",
      "paragraph_index": 186,
      "chapter_index": 16,
      "chapter_id": "Text/part0000_split_018.html"
    },
    {
      "skippy_text": "“Jump\nis programmed into the nav system,” Skippy said with only a touch of his usual\nsmugness.",
      "full_paragraph": "“Jump\nis programmed into the nav system,” Skippy said with only a touch of his usual\nsmugness.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“No,”\nmy XO shook her head. “I just want to get \non\n with it.”\n“We\nall do,” I agreed.",
      "context_after": "“Pilot,”\nI tried to project authority in my voice. “Jump option Delta. Engage.”",
      "paragraph_index": 114,
      "chapter_index": 17,
      "chapter_id": "Text/part0000_split_019.html"
    },
    {
      "skippy_text": "Two\nminutes later, Skippy sighed. “I’m sorry, Joe. There is no sign of the buoy.\nThe extreme distortion of our jump may have destroyed it.”",
      "full_paragraph": "Two\nminutes later, Skippy sighed. “I’m sorry, Joe. There is no sign of the buoy.\nThe extreme distortion of our jump may have destroyed it.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Uh,\nbad news, Joe. I did that already. It’s not responding. I am afraid to say\nthis, but the buoy might have been damaged by the distortion when we jumped out\nof here.”\n“Shit.\nWarm up the active sensors and ping for the damned thing.”",
      "context_after": "“Shit!\nWithout that buoy, Chang has no way to know where we went. Is there any sign\nthe \nDutchman\n was here?”",
      "paragraph_index": 121,
      "chapter_index": 17,
      "chapter_id": "Text/part0000_split_019.html"
    },
    {
      "skippy_text": "“No,”\nSkippy replied. “I am detecting only very faint jump resonance signatures, too\ndegraded to be recent. Too faint to tell what type of ship was here.”",
      "full_paragraph": "“No,”\nSkippy replied. “I am detecting only very faint jump resonance signatures, too\ndegraded to be recent. Too faint to tell what type of ship was here.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "Two\nminutes later, Skippy sighed. “I’m sorry, Joe. There is no sign of the buoy.\nThe extreme distortion of our jump may have destroyed it.”\n“Shit!\nWithout that buoy, Chang has no way to know where we went. Is there any sign\nthe \nDutchman\n was here?”",
      "context_after": "“Ok.\nNo sense wasting time here. Jump us to the planned rendezvous point, Chang\nwould have gone there.”",
      "paragraph_index": 123,
      "chapter_index": 17,
      "chapter_id": "Text/part0000_split_019.html"
    },
    {
      "skippy_text": "“What\nhappened?” Skippy shouted. “Pure, weapons-grade \nawesomeness\n is what\nhappened! I am \nback\n, baby! Large and in charge!”",
      "full_paragraph": "“What\nhappened?” Skippy shouted. “Pure, weapons-grade \nawesomeness\n is what\nhappened! I am \nback\n, baby! Large and in charge!”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "Bishop\nshook his head. “It is a \nlong\nst\n-”",
      "context_after": "Chang\ncovered his eyes with a hand. “And humble as always, I see.”",
      "paragraph_index": 13,
      "chapter_index": 18,
      "chapter_id": "Text/part0000_split_020.html"
    },
    {
      "skippy_text": "When\nthe presentation was ready, Skippy asked about timing. “It has to be soon, Joe.\nChang has been asking a \nlot\n of questions, it’s like he knows there is\nsomething different about me.”",
      "full_paragraph": "When\nthe presentation was ready, Skippy asked about timing. “It has to be soon, Joe.\nChang has been asking a \nlot\n of questions, it’s like he knows there is\nsomething different about me.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“That\nwas \nyour\n idea, Joe.”\n“Yeah,\nand it doesn’t seem so funny now.”",
      "context_after": "“Did\nyou tell him you are ashamed that you panicked and cut the wormhole\nconnections?”",
      "paragraph_index": 168,
      "chapter_index": 18,
      "chapter_id": "Text/part0000_split_020.html"
    },
    {
      "skippy_text": "does\n, if, or when, other AIs begin to wake up,” Skippy insisted.",
      "full_paragraph": "does\n, if, or when, other AIs begin to wake up,” Skippy insisted.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Ok,”\nsetting the glass down with a shaky hand, I sat back in the chair. “Does any of\nthis matter?”\n“It",
      "context_after": "Chang\nheld up a hand to stop my next outburst. “Realistically, can we do anything to\nprevent AIs from awakening?”",
      "paragraph_index": 26,
      "chapter_index": 19,
      "chapter_id": "Text/part0000_split_021.html"
    },
    {
      "skippy_text": "“That’s\nthe point,” Skippy replied with an accusing glance at me. “We might be able to\ndo something about it, if I can verify my memories, figure out what data I have\nis accurate.”",
      "full_paragraph": "“That’s\nthe point,” Skippy replied with an accusing glance at me. “We might be able to\ndo something about it, if I can verify my memories, figure out what data I have\nis accurate.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "does\n, if, or when, other AIs begin to wake up,” Skippy insisted.\nChang\nheld up a hand to stop my next outburst. “Realistically, can we do anything to\nprevent AIs from awakening?”",
      "context_after": "“How\ncan we do that?” Chang continued, as I sat back. I was too emotional to think\nabout it rationally.",
      "paragraph_index": 28,
      "chapter_index": 19,
      "chapter_id": "Text/part0000_split_021.html"
    },
    {
      "skippy_text": "“True.\nWhen I asked Skippy about that, he told me the wake-up or reboot process he\nwent through, was the same as for ending a self-induced dormancy. Although, he\ndid admit his memories of that time are vague. The point is, he thinks there is\na strong probability that Elder AIs are vulnerable when they are dormant. Not\nvulnerable to \nus\n, not with conventional or even nuclear weapons.\nVulnerable to someone who can manipulate spacetime, like Skippy. If he can sever\nan AI’s connection to higher spacetime, it won’t be able to hurt us.”",
      "full_paragraph": "“True.\nWhen I asked Skippy about that, he told me the wake-up or reboot process he\nwent through, was the same as for ending a self-induced dormancy. Although, he\ndid admit his memories of that time are vague. The point is, he thinks there is\na strong probability that Elder AIs are vulnerable when they are dormant. Not\nvulnerable to \nus\n, not with conventional or even nuclear weapons.\nVulnerable to someone who can manipulate spacetime, like Skippy. If he can sever\nan AI’s connection to higher spacetime, it won’t be able to hurt us.”",
      "trigger": "",
      "tones": [
        "technobabble"
      ],
      "partner": "crew",
      "context_before": "“He\ndoesn’t know, but there is no reason to think his experience is any different\nfrom other AIs.”\n“There\nis a reason, Sir.” Smythe countered. “Skippy did not go dormant willingly. He\nwas attacked and disabled.”",
      "context_after": "“Assuming\nSkippy is right. Also assuming we can catch an AI while it is napping. Those\nare a lot of assumptions, Sir.”",
      "paragraph_index": 113,
      "chapter_index": 19,
      "chapter_id": "Text/part0000_split_021.html"
    },
    {
      "skippy_text": "“\nNoooooo\n!” Skippy shouted.",
      "full_paragraph": "“\nNoooooo\n!” Skippy shouted.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "other_ai",
      "context_before": "“Have\nmercy,” he pleaded.\n“\nBilby,\n also throw in there the ultimate punishment. The\ncollected songbook of \nMichael McDonald\n.”",
      "context_after": "Half\nan hour later, I was in the gym, sitting down on a rowing machine when Bilby\ncalled me. “Uh, hey, Colonel Dude. Should I, like, keep playing that music?”",
      "paragraph_index": 178,
      "chapter_index": 19,
      "chapter_id": "Text/part0000_split_021.html"
    },
    {
      "skippy_text": "The\nmission had begun well. The first site we visited was the most important on\nSkippy’s list. It was deep in the territory of the Esselgin, a species we had\nno dealings with, nor did I want to engage with those snakes. Technically, the\nEsselgin were shaped sort of like salamanders, they had long, slender bodies with\nshort rear legs splayed out to the side. A tail provided balance so they could\nwalk upright and use their forefeet as hands. Most species had legless animals\nlike snakes on their \nhomeworlds\n, and the Esselgin\nwere universally referred to as whatever snake-equivalents were called. The\nstereotype was reinforced by the speech of the Esselgin, they had a distinctive\nhissing lisp. In terms of technology, the snakes were roughly equal to the\nThuranin and Bosphuraq, though the Esselgin were much younger. They also had a\nsort of bragging rights from always having been direct clients of the Maxolhx,\nnever having to suffer millennia as a third-tier species in the coalition.\nSkippy warned that the Esselgin were smart and dangerous, because they were\nalso \nclever\n.",
      "full_paragraph": "The\nmission had begun well. The first site we visited was the most important on\nSkippy’s list. It was deep in the territory of the Esselgin, a species we had\nno dealings with, nor did I want to engage with those snakes. Technically, the\nEsselgin were shaped sort of like salamanders, they had long, slender bodies with\nshort rear legs splayed out to the side. A tail provided balance so they could\nwalk upright and use their forefeet as hands. Most species had legless animals\nlike snakes on their \nhomeworlds\n, and the Esselgin\nwere universally referred to as whatever snake-equivalents were called. The\nstereotype was reinforced by the speech of the Esselgin, they had a distinctive\nhissing lisp. In terms of technology, the snakes were roughly equal to the\nThuranin and Bosphuraq, though the Esselgin were much younger. They also had a\nsort of bragging rights from always having been direct clients of the Maxolhx,\nnever having to suffer millennia as a third-tier species in the coalition.\nSkippy warned that the Esselgin were smart and dangerous, because they were\nalso \nclever\n.",
      "trigger": "",
      "tones": [
        "insult",
        "technobabble"
      ],
      "partner": "unknown",
      "context_before": "“If\nI knew the source of the problem, I would have told you. And I would be working\nto fix it.”\n“Wait,”\nI held up a hand, more for myself than him. From the pilot’s couches, Reed and Chen\nlooked back at me. They were not shirking their duties, they had nothing to do.\nOur jump drive wasn’t working. Without the ability to jump, we were stuck\nthere, twenty-six thousand lightyears from Earth.",
      "context_after": "Anyway,\nnone of that mattered to us at the time. The plan called for us to avoid all\ncontact with the Esselgin, all contact with anyone. That aspect of the plan\nworked flawlessly, we did not detect any ships or even a fading jump signature.\nUnfortunately, the first site we explored was a bust in terms of verifying\nSkippy’s memories. Some of the details of that star system matched Skippy’s\nnewly-recovered data, but other details contradicted his memories, and he couldn’t\nunderstand why. So, he was in a foul mood when we jumped away toward the next\nsite on the list.",
      "paragraph_index": 113,
      "chapter_index": 20,
      "chapter_id": "Text/part0000_split_022.html"
    },
    {
      "skippy_text": "“Nope,\nJoe,” Skippy sighed after I suggested he do his trick of creating an especially\nflat area of spacetime around the ship. “That won’t work.”",
      "full_paragraph": "“Nope,\nJoe,” Skippy sighed after I suggested he do his trick of creating an especially\nflat area of spacetime around the ship. “That won’t work.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "other_ai",
      "context_before": "We\nall put on our Thinking Caps. We tried everything. Or, we didn’t actually \ntry\nany of the ideas that I, or Nagatha, or Reed or even Skippy himself dreamed up.\nNone of the ideas would work, or they wouldn’t work fast enough.",
      "context_after": "“Why\nnot?” I protested. “You said it could disrupt the loop effect that is bending\nour wormhole back on us.”",
      "paragraph_index": 71,
      "chapter_index": 21,
      "chapter_id": "Text/part0000_split_023.html"
    },
    {
      "skippy_text": "“No,”\nSkippy explained. “It could attack the ship without damaging \nme\n.”",
      "full_paragraph": "“No,”\nSkippy explained. “It could attack the ship without damaging \nme\n.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "other_ai",
      "context_before": "“Uh!”\nHe shushed me with a wagging finger. “I was getting to that. The biggest\nproblem we have with \nany\n of these ideas is that they won’t work fast\nenough. If the Sentinel sees we are trying to escape, it would very likely destroy\nthe ship.”\nNagatha\ngasped. “You believe the Sentinel would kill you, rather than allow you to\nescape?”",
      "context_after": "“Shit,”\nI groaned. “That’s no good.”",
      "paragraph_index": 78,
      "chapter_index": 21,
      "chapter_id": "Text/part0000_split_023.html"
    },
    {
      "skippy_text": "“Ready?”\nSkippy asked, though he had access to every system aboard the ship.",
      "full_paragraph": "“Ready?”\nSkippy asked, though he had access to every system aboard the ship.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "I\nthink he is still traumatized by that.\nAnyway,\nwe got the ship ready, and counted down to the moment when the last of the four\nmicrowormholes passed an imaginary line fifty-eight billion kilometers from the\nship.",
      "context_after": "“Hey,”\nI held up an index finger. “One question, please. You are sure you have the\ncorrect authentication codes of another Elder AI?”",
      "paragraph_index": 21,
      "chapter_index": 22,
      "chapter_id": "Text/part0000_split_024.html"
    },
    {
      "skippy_text": "There\nis was. The front half of our RV, or ‘caravan’ as Smythe had called it. That\ntrusty vehicle had taken us most of the way to the Kristang scavenger camp,\nuntil, as Skippy said, it sank while we were crossing a river.",
      "full_paragraph": "There\nis was. The front half of our RV, or ‘caravan’ as Smythe had called it. That\ntrusty vehicle had taken us most of the way to the Kristang scavenger camp,\nuntil, as Skippy said, it sank while we were crossing a river.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "you\n are the reason we can’t have nice things,” he sniffed.\n“Sorry,”\nI mumbled. “Can you enhance the view?”",
      "context_after": "That\nmission had been a complete success. It was my first time cooking up a\ncomplicated operation that involved deception, something that had sort of\nbecome my trademark. Newark was the first time I really felt like a commander,\nrather than a sergeant role-playing way out of my league. I vividly remember\nhow, after we killed the last Kristang, Smythe had stood up and saluted me. He\nhad been astonished that my horribly complicated scheme had worked. Truthfully,\nthat had surprised the hell out of me too.",
      "paragraph_index": 20,
      "chapter_index": 23,
      "chapter_id": "Text/part0000_split_025.html"
    },
    {
      "skippy_text": "“Meh,\nthat’s not really true, Joe,” Skippy said, because he \ncannot\n keep his STUPID\nFREAKIN’ MOUTH SHUT. “The Sentinel at Waterloo was damaged, and so is not\ntypical of such machines we might encounter in the future. Which is a damned\ngood thing, because I really thought that was the end for us. Plus, it was a\nunique situation. I very much doubt other Sentinels have prepared the\nunderlying structure of local spacetime to loop jump wormholes back on\nthemselves. Nope, I hate to say this, but there aren’t any useful lessons to be\nlearned from that incident.”",
      "full_paragraph": "“Meh,\nthat’s not really true, Joe,” Skippy said, because he \ncannot\n keep his STUPID\nFREAKIN’ MOUTH SHUT. “The Sentinel at Waterloo was damaged, and so is not\ntypical of such machines we might encounter in the future. Which is a damned\ngood thing, because I really thought that was the end for us. Plus, it was a\nunique situation. I very much doubt other Sentinels have prepared the\nunderlying structure of local spacetime to loop jump wormholes back on\nthemselves. Nope, I hate to say this, but there aren’t any useful lessons to be\nlearned from that incident.”",
      "trigger": "",
      "tones": [
        "insult",
        "technobabble"
      ],
      "partner": "unknown",
      "context_before": "“If\nyou remember, Sir, taking the \nDutchman\n out so Skippy can stroll down\nMemory Lane was \nyour\n idea. I advised against it.”\n“OK,\nso we did encounter a Sentinel,” I admitted. “Look on the bright side: now we\nknow how to escape, if we encounter another of-”",
      "context_after": "“How\nabout,” Simms asked, “we learn not to take unnecessary risks?”",
      "paragraph_index": 154,
      "chapter_index": 23,
      "chapter_id": "Text/part0000_split_025.html"
    },
    {
      "skippy_text": "“Hmm,\nthat’s a good one,” Skippy muttered. “Let me write that down.”",
      "full_paragraph": "“Hmm,\nthat’s a good one,” Skippy muttered. “Let me write that down.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Meh,\nthat’s not really true, Joe,” Skippy said, because he \ncannot\n keep his STUPID\nFREAKIN’ MOUTH SHUT. “The Sentinel at Waterloo was damaged, and so is not\ntypical of such machines we might encounter in the future. Which is a damned\ngood thing, because I really thought that was the end for us. Plus, it was a\nunique situation. I very much doubt other Sentinels have prepared the\nunderlying structure of local spacetime to loop jump wormholes back on\nthemselves. Nope, I hate to say this, but there aren’t any useful lessons to be\nlearned from that incident.”\n“How\nabout,” Simms asked, “we learn not to take unnecessary risks?”",
      "context_after": "“Simms!”\nI barked just as she opened her mouth. “You can read the full report later. We\nare here now, nobody got hurt, and we accomplished the mission under conditions\nthat were difficult and unexpected.”",
      "paragraph_index": 156,
      "chapter_index": 23,
      "chapter_id": "Text/part0000_split_025.html"
    },
    {
      "skippy_text": "“Not\nyet,” Skippy replied. “It’s more about the journey than the destination.”",
      "full_paragraph": "“Not\nyet,” Skippy replied. “It’s more about the journey than the destination.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Simms,\nyou are like a dog with a bone. You’re never going to let this go?”\n“I\ndon’t plan to, no.” She took a breath. “You \nare\n here, that’s good. Did\nverifying Skippy’s memories give us a way to find hibernating AIs?”",
      "context_after": "Another\narched eyebrow from Simms. She didn’t need to say anything.",
      "paragraph_index": 161,
      "chapter_index": 23,
      "chapter_id": "Text/part0000_split_025.html"
    },
    {
      "skippy_text": "“You\nwant to go back there?” Skippy said, in a way implying that would be a bad\nidea.",
      "full_paragraph": "“You\nwant to go back there?” Skippy said, in a way implying that would be a bad\nidea.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“No.\nNo way, Dude. The wormholes I moved are \ndormant\n. No one even knows they exist;\nthey would have no way to detect them being relocated. There will not be any\nvisible effect, until I trigger those relocated wormholes to boot up.”\n“Crap.\nNow I wish we had hit up that Maxolhx relay station for info.”",
      "context_after": "“No.\nIt’s a minor mystery we can live with. That’s it?”",
      "paragraph_index": 191,
      "chapter_index": 24,
      "chapter_id": "Text/part0000_split_026.html"
    },
    {
      "skippy_text": "“What?”\nSkippy asked.",
      "full_paragraph": "“What?”\nSkippy asked.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“They\ndon’t know it is \nyou\n, not yet anyway.” The holographic display\nshimmered, and an image of me appeared. The image must have been taken shortly\nafter I was captured by the Thuranin. I was still in my flightsuit, though the\ntop had been ripped open. My hair had not yet been shaved down the middle in an\nembarrassing No-hawk. Though I don’t remember it, the Thuranin must have\nroughed me up, my face was bruised and bloody, with cuts on my chest. My eyes\nwere open, staring blankly and unfocused. “This image, along with details about\nyour biometrics and DNA, are in the bulletin. It states that this human\ncommitted crimes against the Thuranin at Rakesh Diwalen, and requests that you\nbe identified.”\nTurning\nto Simms, I shrugged. “You were right. This will cause trouble for UNEF on\nParadise, damn it.””",
      "context_after": "“Ah,\nI wish it was a better picture. Cornpone and Ski, and everyone, they have all\nbeen thinking I was dead. Now they’ll see \nthis\n.”",
      "paragraph_index": 198,
      "chapter_index": 24,
      "chapter_id": "Text/part0000_split_026.html"
    },
    {
      "skippy_text": "this\n is odd,” Skippy announced as our ships drifted in empty\ninterstellar space, waiting for an Elder wormhole to open. It was an ordinary\nwormhole that connected to where it was supposed to connect, Skippy hadn’t\nscrewed with it. That wormhole was on the same local network as the far end of\nBackstop, the dormant wormhole that had moved its other end close to Earth. We\nhad gone through three wormholes to get there, instead of creating our usual\nshortcuts, because Skippy didn’t want to risk screwing with that network while\nit was still in the process of relocating a wormhole we needed. So, we had\nparked the ships seventeen light-seconds from where the wormhole was scheduled\nto emerge. As soon as we saw that it was stable, and Skippy pinged the network\nto make sure there weren’t any ships waiting on the other end, we would jump in\nfront of the event horizon, and transition through. From there, it was a\nfour-day trip of continuous jumping, to get to where the far end of Backstop\nhad been moved to.",
      "full_paragraph": "this\n is odd,” Skippy announced as our ships drifted in empty\ninterstellar space, waiting for an Elder wormhole to open. It was an ordinary\nwormhole that connected to where it was supposed to connect, Skippy hadn’t\nscrewed with it. That wormhole was on the same local network as the far end of\nBackstop, the dormant wormhole that had moved its other end close to Earth. We\nhad gone through three wormholes to get there, instead of creating our usual\nshortcuts, because Skippy didn’t want to risk screwing with that network while\nit was still in the process of relocating a wormhole we needed. So, we had\nparked the ships seventeen light-seconds from where the wormhole was scheduled\nto emerge. As soon as we saw that it was stable, and Skippy pinged the network\nto make sure there weren’t any ships waiting on the other end, we would jump in\nfront of the event horizon, and transition through. From there, it was a\nfour-day trip of continuous jumping, to get to where the far end of Backstop\nhad been moved to.",
      "trigger": "",
      "tones": [
        "technobabble"
      ],
      "partner": "unknown",
      "context_before": "Yuck.\n“Well,",
      "context_after": "“Odd?”\nI asked. There weren’t any alerts shown in the holographic display, and Skippy’s\ntone of voice reflected curiosity rather than alarm, so I wasn’t worried. He\nwas probably talking about some \nnerdnik\n thing like\nthe ratio of hydrogen isotopes in the interstellar medium.",
      "paragraph_index": 37,
      "chapter_index": 25,
      "chapter_id": "Text/part0000_split_027.html"
    },
    {
      "skippy_text": "“Um,\nwhy did we jump?” Skippy asked.",
      "full_paragraph": "“Um,\nwhy did we jump?” Skippy asked.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Pilot!”\nI snapped my fingers. “Jump option Delta, \nnow\n!”\nThere\nwas a moment’s hesitation as we waited for the \nDutchman\n to acknowledge\nthe signal, then we both jumped away.",
      "context_after": "“Because\nif there is another Elder AI around here, we want to be far away.”",
      "paragraph_index": 52,
      "chapter_index": 25,
      "chapter_id": "Text/part0000_split_027.html"
    },
    {
      "skippy_text": "The\nsearch did not take three hours. It did not even take \none\n hour.\nForty-one minutes into the search pattern, the holographic display lit up, and\nSkippy shouted. “Found it! The wormhole is not dormant, that’s for sure. The\ntiming is, hmm. What the \nhell\n? That makes zero sense!”",
      "full_paragraph": "The\nsearch did not take three hours. It did not even take \none\n hour.\nForty-one minutes into the search pattern, the holographic display lit up, and\nSkippy shouted. “Found it! The wormhole is not dormant, that’s for sure. The\ntiming is, hmm. What the \nhell\n? That makes zero sense!”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“I\nthink sitting here isn’t accomplishing anything,” she said very sensibly. “We\ntold the \nDutchman\n we would be back in an hour.”\n“Oh,\nyeah. Let’s jump back to give Chang an update first.”",
      "context_after": "“What\nis it?” I asked.",
      "paragraph_index": 92,
      "chapter_index": 25,
      "chapter_id": "Text/part0000_split_027.html"
    },
    {
      "skippy_text": "It\nsucked to let Fangiu down like that, after he worked so hard on his slides. To\nmake sure I wasn’t missing another obvious factor, I told Chang and Simms and\nSmythe and others about the Jeraptha cadet’s idea, and they kicked it around,\nbringing Skippy and Nagatha into the discussion. Everyone agreed it was a good\nnotion, but not practical. Approaching the Jeraptha would expose our secret,\nwithout any guarantee they would help us, or could help us in any useful way.\nThe transport ships would be racing the Maxolhx to Earth. Skippy said we had to\ninclude thirty to forty days to adapt Jeraptha ships to carry humans, plus time\nto load them. Sixty to seventy days, minimum, and the whole time we would be\nlooking over our shoulders for Maxolhx warships to jump in and hammer the\ntransports.",
      "full_paragraph": "It\nsucked to let Fangiu down like that, after he worked so hard on his slides. To\nmake sure I wasn’t missing another obvious factor, I told Chang and Simms and\nSmythe and others about the Jeraptha cadet’s idea, and they kicked it around,\nbringing Skippy and Nagatha into the discussion. Everyone agreed it was a good\nnotion, but not practical. Approaching the Jeraptha would expose our secret,\nwithout any guarantee they would help us, or could help us in any useful way.\nThe transport ships would be racing the Maxolhx to Earth. Skippy said we had to\ninclude thirty to forty days to adapt Jeraptha ships to carry humans, plus time\nto load them. Sixty to seventy days, minimum, and the whole time we would be\nlooking over our shoulders for Maxolhx warships to jump in and hammer the\ntransports.",
      "trigger": "",
      "tones": [
        "technobabble"
      ],
      "partner": "unknown",
      "context_before": "“We\ncould \ntry\n,” he pleaded.\n“I’ll\nthink about it, OK?” Pulling the laptop closer to me, I gestured at it. “We\nshould discuss this again, after I review your presentation?”",
      "context_after": "It\nwas just no good.",
      "paragraph_index": 53,
      "chapter_index": 26,
      "chapter_id": "Text/part0000_split_028.html"
    },
    {
      "skippy_text": "“We\nare, Joe,” Skippy sighed. “As much as I can. The fabricators are not the issue,\nwe need the proper materials. Mining asteroids out here would take too long, we\nneed materials made on Earth. The monkeys there did a \ndecent\njob manufacturing components\n when we rebuilt the \nDutchman\n in\norbit, but your industrial base is still only capable of making simple items. Even",
      "full_paragraph": "“We\nare, Joe,” Skippy sighed. “As much as I can. The fabricators are not the issue,\nwe need the proper materials. Mining asteroids out here would take too long, we\nneed materials made on Earth. The monkeys there did a \ndecent\njob manufacturing components\n when we rebuilt the \nDutchman\n in\norbit, but your industrial base is still only capable of making simple items. Even",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "unknown",
      "context_before": "“Damn\nit. OK, I was hoping the transports could get through the next wormhole on\ntheir own, that’s not going to happen.” Even with Skippy tweaking the crappy\noriginal Kristang jump drives of the \nQishan\n and \nDagger\n, they\ncould barely travel a single lightyear on their own. “We have to plan for the \nDutchman\nto be worked on after the transports go through Backstop outbound. Is there any\nway we can start modifying the \nDutchman\n now?”",
      "context_after": "wth\n the resources of Earth, turning the \nDutchman",
      "paragraph_index": 12,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“I\nknow,” Skippy explained without his usual snarkiness, “because when I tried to\nuse pixies to hit that relay station for info, it basically replied with ‘Error\n405: Method Not Allowed’. Then it informed me that the entire system of pixies\nwas no longer trusted, and there is a new process for exchanging data. That was\nthe \nonly\n information it would give to me. The station’s AI was snippy\nabout it, too, made me want to smack the damned thing,” he sniffed.",
      "full_paragraph": "“I\nknow,” Skippy explained without his usual snarkiness, “because when I tried to\nuse pixies to hit that relay station for info, it basically replied with ‘Error\n405: Method Not Allowed’. Then it informed me that the entire system of pixies\nwas no longer trusted, and there is a new process for exchanging data. That was\nthe \nonly\n information it would give to me. The station’s AI was snippy\nabout it, too, made me want to smack the damned thing,” he sniffed.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Shit.\nWonderful,” I groaned.\nSimms\nasked a question that I hadn’t even considered. “Skippy, how do you know the\nprocedures, if you were not able to communicate with a relay station?”",
      "context_after": "“We\nappreciate your admirable restraint, old chap,” Smythe said with dry British\nhumor.",
      "paragraph_index": 24,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“No\nit \ncan \nnot\n,” Skippy protested. “Were you\nmonkeys even \nlistening\n to me?”",
      "full_paragraph": "“No\nit \ncan \nnot\n,” Skippy protested. “Were you\nmonkeys even \nlistening\n to me?”",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "crew",
      "context_before": "I\nlooked at Smythe. “What do you think?”\nHe\nlooked at the ceiling for a moment. “It can be done.”",
      "context_after": "“We\nwere listening. Do you listen to \nyourself\n?” I asked.",
      "paragraph_index": 38,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“May\nI guess the next step in your lunatic scheme?” Skippy asked.",
      "full_paragraph": "“May\nI guess the next step in your lunatic scheme?” Skippy asked.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "difficult. Then Smythe takes a STAR team to breach the hull, and capture the\ncrew alive?”\n“Correct,”\nSmythe said with a hint of a smile. He was already planning the boarding\noperation in his head.",
      "context_after": "“Please\ndo,” I encouraged him.",
      "paragraph_index": 47,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“I\nremember he was a \nterrible\n guest,” Skippy grumbled. “Snuggles tried to\nkill the entire crew, do you remember that?”",
      "full_paragraph": "“I\nremember he was a \nterrible\n guest,” Skippy grumbled. “Snuggles tried to\nkill the entire crew, do you remember that?”",
      "trigger": "“Regardless\nof some of the sketchy shit we’ve done out here, we are soldiers,” I insisted.\n“We have a code of conduct. That’s the difference between an army and a mob.”\nSmythe nodded when I said that, and it felt good for him to acknowledge my\nprofessionalism.",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“That\nis good to hear,” Skippy tilted his head at me. “Then I do not understand your\nplan. Trust me, the Maxolhx will not willingly give you access to a relay\nstation, even if you offer a lifetime supply of catnip.”\n“No\ncatnip needed, Skippy,” I grinned and sat back in my chair. “Remember in the\nRoach Motel, we had Mister Snuggles as a guest?”",
      "context_after": "“I\ndo. Do you remember making him dance to ‘\nFunkytown\n’?”",
      "paragraph_index": 55,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“Wait\na minute,” Skippy interrupted. “We can’t build a model of an entire courier\nship, but we don’t need to. The crew accommodation section of a courier ship is\nvery small. We could construct a model in a docking bay, and float it outside\nto practice breaching the hull.”",
      "full_paragraph": "“Wait\na minute,” Skippy interrupted. “We can’t build a model of an entire courier\nship, but we don’t need to. The crew accommodation section of a courier ship is\nvery small. We could construct a model in a docking bay, and float it outside\nto practice breaching the hull.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Yes,\nSir,” he anticipated my order. “We will study the layout of a courier ship, and\nhave a boarding plan ready ASAP. The timing will be a bit dodgy. No possibility\nof building a mockup of a courier ship, for practice?”\n“Sorry,\nno,” I gave him the answer he expected. “We can’t-”",
      "context_after": "“Do\nit,” I instructed. “Does anyone have any objections?”",
      "paragraph_index": 78,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "As\nSkippy suggested, we built a mockup of a courier ship’s crew section, which\neasily fit inside one of our larger docking bays. To practice the boarding\noperation, we attached the mockup to several dropships, to simulate the mass of\nthe courier ship’s forward hull, and the STAR team ran through one scenario\nafter another. The already-depleted STARs were down one man, due to the injury suffered\nby Justin Grudzien on Rikers, and I expected Smythe would bring in some of the\nCommandos. He did include Fabron’s Commandos as a backup force, but his\nsolution to replace Grudzien surprised me.",
      "full_paragraph": "As\nSkippy suggested, we built a mockup of a courier ship’s crew section, which\neasily fit inside one of our larger docking bays. To practice the boarding\noperation, we attached the mockup to several dropships, to simulate the mass of\nthe courier ship’s forward hull, and the STAR team ran through one scenario\nafter another. The already-depleted STARs were down one man, due to the injury suffered\nby Justin Grudzien on Rikers, and I expected Smythe would bring in some of the\nCommandos. He did include Fabron’s Commandos as a backup force, but his\nsolution to replace Grudzien surprised me.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Yeah,\nof course. If we wait too long, it will be OBE.”\nSimms\nshook her head. “If we wait too long, \nwe\n could be OBE.”",
      "context_after": "“You\nreally think she is ready?” I asked, when Smythe told me he requested Margaret\nAdams be transferred from her duties aboard the \nFlying Dutchman\n. “She\nis-”",
      "paragraph_index": 83,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“There\nisn’t any other place to \ngo\n,” Skippy retorted, miffed at his awesomeness\nbeing questioned. “It’s not outside, I’m sure of that. If it is not \nout\nside,\nthen it must be \nin\nside. Did you check all the closets?”",
      "full_paragraph": "“There\nisn’t any other place to \ngo\n,” Skippy retorted, miffed at his awesomeness\nbeing questioned. “It’s not outside, I’m sure of that. If it is not \nout\nside,\nthen it must be \nin\nside. Did you check all the closets?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“I\ndon’t know. You were supposed to keep track of it. Kitties are \nbig\n, how\ncould you lose one in such a small space?”\n“It’s\nnot in the crew compartment area,” Kapoor insisted. “When it retreated back\nthrough the airlock, it must have gone somewhere else. You must have missed it.”",
      "context_after": "“There\nare no- Captain Frey, take over arguing with the beer can, while I conduct a\nproper search,” Kapoor ordered.",
      "paragraph_index": 157,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "Skippy\nanswered for the crew. “The active sensor pulses are too powerful to use at\nthis short range. They are designed to find stealthed \nstarships\n at long\nrange. Adams would be cooked, and we would risk killing the kitty also.”",
      "full_paragraph": "Skippy\nanswered for the crew. “The active sensor pulses are too powerful to use at\nthis short range. They are designed to find stealthed \nstarships\n at long\nrange. Adams would be cooked, and we would risk killing the kitty also.”",
      "trigger": "",
      "tones": [
        "technobabble"
      ],
      "partner": "crew",
      "context_before": "“Eagle-Two\nis away,” the pilot reported, and Adams saw a sleek shape racing away. “No\nhitchhikers,” the pilot confirmed.\n“\nValkyrie\n,\ncan you use the ship’s active sensors to locate Tango-1?” Adams asked.",
      "context_after": "“Bloody\nhell,” Smythe grunted. “How are we supposed to find an invisible enemy? \nKapoor,\n stay here with the captives. Frey, you’re with me.”",
      "paragraph_index": 180,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“No!”\nSkippy shouted. “No time to wait, you are all in danger! That kitty was trying\nto explode the ship’s reserve powercells, it could kill all of you! I can’t\nstop it from here. You have to-”",
      "full_paragraph": "“No!”\nSkippy shouted. “No time to wait, you are all in danger! That kitty was trying\nto explode the ship’s reserve powercells, it could kill all of you! I can’t\nstop it from here. You have to-”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "The\ncombot jerked as it was struck by some sort of return fire. Adams flattened\nherself against the hull, red symbols lighting up on a corner of her visor as\nthe combot’s systems dropped offline. She tried to shoot back but both maser\ncannons were inoperative and when she looked over, she saw why. The left side\nof the combot’s stout torso was missing, along with a crater in its chest.\nPowercells were arcing electricity into space, and the machine was blind.\nSmythe\nsaw the same data as Adams. “\nGunny,\n hold your\nposition. We are forty seconds out, do not-”",
      "context_after": "Margaret\nAdams didn’t wait. Rolling on the hull to take up a position behind the\ncrippled combot, she got it lined up with the antenna and-",
      "paragraph_index": 194,
      "chapter_index": 27,
      "chapter_id": "Text/part0000_split_029.html"
    },
    {
      "skippy_text": "“OK,”\nSkippy muttered, giving us a play-by-play. “She has transmitted her personal\nidentification codes, \naaaand\n, the station AI has\naccepted. The door to the scanning booth is opening, she is walking forward\nand- Now a message from our sponsor. Fenway Franks are the genuine major league\nhot dog, get them at your local-”",
      "full_paragraph": "“OK,”\nSkippy muttered, giving us a play-by-play. “She has transmitted her personal\nidentification codes, \naaaand\n, the station AI has\naccepted. The door to the scanning booth is opening, she is walking forward\nand- Now a message from our sponsor. Fenway Franks are the genuine major league\nhot dog, get them at your local-”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Great.\nGoodbye, Skippy.”\nWith\nthe Dutchman nearby in case we needed help, we jumped \nValkyrie\n in near a\nMaxolhx relay station, one that saw enough traffic that it would likely have\nupdated information, but not so much traffic that there was a big risk of ships\njumping in while we hacked the station. Skippy flew a Panther dropship over to\nthe station, and Anastacia walked out, disguised as a Maxolhx. Though Skippy\nhad a real-time connection to her, through one end of a microwormhole concealed\ninside her chassis, he did not know whether the scanning booth might interfere\nwith the connection. So, Anastacia had been programmed to operate autonomously\nas much as possible. The fact that Skippy wasn’t sure whether the microwormhole\nwould be detected was a good reason to conduct a test with a robot.",
      "context_after": "“\nSkippy\n!”\nI shouted at him.",
      "paragraph_index": 44,
      "chapter_index": 28,
      "chapter_id": "Text/part0000_split_030.html"
    },
    {
      "skippy_text": "“Ready\nas he will ever be,” Skippy said sourly. While he enjoyed making arrogant\naliens dance and act like puppets, he did not like turning Elmo into a\nbiological robot, even temporarily. Even if it was for a very good cause.",
      "full_paragraph": "“Ready\nas he will ever be,” Skippy said sourly. While he enjoyed making arrogant\naliens dance and act like puppets, he did not like turning Elmo into a\nbiological robot, even temporarily. Even if it was for a very good cause.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“I\nrequested permission for the Panther to return, station is opening the docking\nbay doors now.”\n“Good.\nIs Elmo ready?”",
      "context_after": "When\nthe station’s enforced lockdown was over, we jumped \nValkyrie\n back in and\nimmediately launched the Panther carrying Elmo. Skippy guided the stolen\ndropship into the docking bay, and Elmo got out. Watching through the Panther’s\nexternal sensors, I tensed up in the command chair. “Skippy, he is walking kind\nof stiff, like he is injured.”",
      "paragraph_index": 56,
      "chapter_index": 28,
      "chapter_id": "Text/part0000_split_030.html"
    },
    {
      "skippy_text": "“Not\nexactly. Why?” Skippy asked.",
      "full_paragraph": "“Not\nexactly. Why?” Skippy asked.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“She\ndoesn’t know she is chasing \nus\n, Joe.”\n“You\nknow what I mean. Shit. Do you know the flight path of this Illiath’s ship?”",
      "context_after": "“Because\nI’m thinking we maybe should intercept her ship. Take her out, before she does\nany more damage.”",
      "paragraph_index": 89,
      "chapter_index": 28,
      "chapter_id": "Text/part0000_split_030.html"
    },
    {
      "skippy_text": "“Skippy\nsaid you had enough on your plate, and that,” she shrugged. “You would discuss\nit with me when the time was right.”",
      "full_paragraph": "“Skippy\nsaid you had enough on your plate, and that,” she shrugged. “You would discuss\nit with me when the time was right.”",
      "trigger": "Actually,\nas I should have expected, she was way ahead of me. In fact, she had already talked\nabout the subject with Smythe, before he went over to the \nDutchman\n.\n“Why,” I asked, mildly frustrated. “Didn’t you mention it to me?”",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "Valkyrie\n jumped away toward the Beta site, I called Simms into my\noffice. This time, I shut the door. We needed to have the happy conversation I\nhad been dreading, since I talked with Chang.\nActually,\nas I should have expected, she was way ahead of me. In fact, she had already talked\nabout the subject with Smythe, before he went over to the \nDutchman\n.\n“Why,” I asked, mildly frustrated. “Didn’t you mention it to me?”",
      "context_after": "“Skippy\nwas not supposed to tell anyone.”",
      "paragraph_index": 4,
      "chapter_index": 29,
      "chapter_id": "Text/part0000_split_031.html"
    },
    {
      "skippy_text": "“OK,”\nSkippy muttered. “Why do I get stuck with the uncultured cretins? Number two on\nthe list is simulated \nsharkskin\n.”",
      "full_paragraph": "“OK,”\nSkippy muttered. “Why do I get stuck with the uncultured cretins? Number two on\nthe list is simulated \nsharkskin\n.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Why\nnot? Think of it this way: if she hates it and marries you anyway, you are\ntruly made for each other.”\n“I’d\nrather not take the risk, if you don’t mind.”",
      "context_after": "“Also\nno.”",
      "paragraph_index": 243,
      "chapter_index": 29,
      "chapter_id": "Text/part0000_split_031.html"
    },
    {
      "skippy_text": "During\nthe beginning of one slow song, Skippy shouted into my earpiece. “Joe, what the\nhell was \nthat\n?”",
      "full_paragraph": "During\nthe beginning of one slow song, Skippy shouted into my earpiece. “Joe, what the\nhell was \nthat\n?”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "Yes,\nthat makes me a terrible person. Get over it, OK?\nAnyway,\nI was spinning hit tunes, and everyone was dancing. The children all danced\nlike nobody was watching, which is really the way everyone should dance.\nReading the crowd, I played high-energy up-tempo dance tunes, then gave people\na break with slower songs. Not just running through a programmed playlist, I\nadded my own touch as the DJ.",
      "context_after": "“What\nare you talking about? I played a song, \nduh\n.”",
      "paragraph_index": 299,
      "chapter_index": 29,
      "chapter_id": "Text/part0000_split_031.html"
    },
    {
      "skippy_text": "“Doctor\nSkippy said it’s just a pulled muscle. There are pills aboard your ship\nsomewhere.”",
      "full_paragraph": "“Doctor\nSkippy said it’s just a pulled muscle. There are pills aboard your ship\nsomewhere.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "He\ngrunted. “Ooh, I hurt my back yesterday.” We separated and he winced. “We have\nall been working in the fields every day.”\n“You\nOK?”",
      "context_after": "“If\nDoctor Skippy orders more tests, you should say no.”",
      "paragraph_index": 68,
      "chapter_index": 30,
      "chapter_id": "Text/part0000_split_032.html"
    },
    {
      "skippy_text": "must be there,” Skippy insisted. “The Elders would not have left a stealth\nfield and gravity-dispersal system to low-level systems. There must be a form\nof higher intelligence in there, somewhere.”",
      "full_paragraph": "must be there,” Skippy insisted. “The Elders would not have left a stealth\nfield and gravity-dispersal system to low-level systems. There must be a form\nof higher intelligence in there, somewhere.”",
      "trigger": "",
      "tones": [
        "technobabble"
      ],
      "partner": "unknown",
      "context_before": "“How\ncan we be sure that anyone’s home in there?” Simms asked.\n“\nSomeone",
      "context_after": "“It\ncouldn’t be an AI like you,” I asked, a chill making the hair on the back of my\nneck stand up. “Could it?”",
      "paragraph_index": 94,
      "chapter_index": 31,
      "chapter_id": "Text/part0000_split_033.html"
    },
    {
      "skippy_text": "“No,\nJoe! Jump drive is offline,” Skippy warned, at the same time the pilot made a\nslashing motion with his hand and pointed to the jump status indicator. It was\nred.",
      "full_paragraph": "“No,\nJoe! Jump drive is offline,” Skippy warned, at the same time the pilot made a\nslashing motion with his hand and pointed to the jump status indicator. It was\nred.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“I\ndon’t know! I don’t know \nwhy\n. Oh, \nshit\n! The ship is being pulled\ndown toward the planet.”\n“Pilot!\nJump option-”",
      "context_after": "We\ncouldn’t jump.",
      "paragraph_index": 146,
      "chapter_index": 31,
      "chapter_id": "Text/part0000_split_033.html"
    },
    {
      "skippy_text": "“We\nare now in the atmosphere,” Skippy announced glumly, and the ship rotated\nsickeningly. On the display, we could see the hull wobbling until it stabilized\nnose-down, pointed straight down at the hellish core of the planet. “Armor\nplating is holding,” he reported.",
      "full_paragraph": "“We\nare now in the atmosphere,” Skippy announced glumly, and the ship rotated\nsickeningly. On the display, we could see the hull wobbling until it stabilized\nnose-down, pointed straight down at the hellish core of the planet. “Armor\nplating is holding,” he reported.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“No,”\nhe shook his head slowly. “The shields have failed. Their generators are pumping\nout gigawatts of power, but the fields are looping back on themselves. I\nrecommend cutting power, before the generators burn out.”\nBeside\nme, Simms gestured to a crewman, who tapped on his console to give the\nappropriate commands. Just then, the ship shuddered again, and there was a\nroaring sound.",
      "context_after": "“For\nhow long?” I asked the question, not really wanting to hear the answer.",
      "paragraph_index": 195,
      "chapter_index": 31,
      "chapter_id": "Text/part0000_split_033.html"
    },
    {
      "skippy_text": "“Um,\nJoe,” Skippy warned. “They are opening missile launch doors.”",
      "full_paragraph": "“Um,\nJoe,” Skippy warned. “They are opening missile launch doors.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Just\ndo it.” I stood up, glancing at my tablet. On the display, the face of a\nMaxolhx appeared, I assumed that was the task force commander. On the tablet\nwas my prepared speech, a short concise message created and approved mostly by\nHans Chotek and the Three Stooges. It explained humanity’s position, offered a\nmutually-beneficial compromise, and opened the door to negotiations. Though I\ndidn’t like mealy-mouthed diplomatic niceties, I had to admit this message\nstruck a good balance, and was firm and professional.\nI\ntossed the tablet back over my shoulder to clatter on the deck. “Hey, \nshithead\n.\nYeah, I’m talking to you, fuzzball.” That got the alien literally spitting mad.\n“What’s that?” I cupped a hand to one ear. “It sounds like you’re coughing up a\nhairball. I’ll give you a minute.”",
      "context_after": "“Joe!",
      "paragraph_index": 24,
      "chapter_index": 33,
      "chapter_id": "Text/part0000_split_035.html"
    },
    {
      "skippy_text": "“Joe,”\nSkippy whispered in my earpiece as I sat in my command chair. “We need to\ntalk.”",
      "full_paragraph": "“Joe,”\nSkippy whispered in my earpiece as I sat in my command chair. “We need to\ntalk.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "“Yes.”\nI relaxed back in my chair. Truly \nrelaxed\n, like, for the first time\nsince Columbus Day. “But first, we need to run a few errands on the way home.”\nWe\nran errands as quickly as we could, not even stopping at the gift shops along\nthe way. I promised everyone a snow globe later, if we survived. After the last\nstop, we pointed \nValkyrie’s\n nose toward Earth and began jumping.\nTechnically, we pointed the ship’s nose \naway\n from Earth, because the\nclosest wormhole was in the opposite direction.",
      "context_after": "“What\nis it?” I said aloud. “And talk to me on the bridge speakers, please.”",
      "paragraph_index": 175,
      "chapter_index": 33,
      "chapter_id": "Text/part0000_split_035.html"
    },
    {
      "skippy_text": "“Um,\nJoe,” Skippy said nervously. “I think he may be calling your bluff.”",
      "full_paragraph": "“Um,\nJoe,” Skippy said nervously. “I think he may be calling your bluff.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "unknown",
      "context_before": "Denoth\nsmiled, looking up at the being who was jabbering meaningless words at him from\nthe ghost ship. “All ships,” he transmitted through his cranial implant. “On my\nsignal, disperse at maximum acceleration. Get to jump distance and perform a\nmaximum-distance jump. Meet at Rendezvous Point Three.” He then switched to\nspeaking in primitive style, with his \nvoicebox\n.\nThe\nMaxolhx commander was ignoring me, which was fine by me. While he was busy\ndoing something else, he wasn’t shooting at us.",
      "context_after": "Hiding\nmy mouth behind a hand, I allowed myself a stress-relieving “\nShit!\n” Then\nI straightened up, as the alien commander looked at me and spoke.",
      "paragraph_index": 21,
      "chapter_index": 34,
      "chapter_id": "Text/part0000_split_036.html"
    },
    {
      "skippy_text": "It\nmight surprise you to learn this, but Skippy can be a bit of a prima donna. The\nsurprise is that sometimes he manages to only be a\n bit\n of a prima donna,\ninstead of the whole nightmarish ego package. This was not one of those times.\nSkippy demanded to be given the full star treatment in front of a new audience,\nand because it was easier to go along rather than him making our lives hell, I\ngave into his demands. Really, it was not that big a deal, considering all that\nhe had done for us filthy monkeys, and I also thought it would be fun.",
      "full_paragraph": "It\nmight surprise you to learn this, but Skippy can be a bit of a prima donna. The\nsurprise is that sometimes he manages to only be a\n bit\n of a prima donna,\ninstead of the whole nightmarish ego package. This was not one of those times.\nSkippy demanded to be given the full star treatment in front of a new audience,\nand because it was easier to go along rather than him making our lives hell, I\ngave into his demands. Really, it was not that big a deal, considering all that\nhe had done for us filthy monkeys, and I also thought it would be fun.",
      "trigger": "",
      "tones": [
        "insult"
      ],
      "partner": "unknown",
      "context_before": "The\nMavericks looked at each other in confusion. “An old friend?”\n“From\nParadise. Uh, just the six of you,” I added the Verd and the Ruhar cadet\nstepped forward. “Just the team who activated the maser cannons. Cadet \nDandurff\n, Surgun Jates, this will not take long, then I\nwill bring you to meet our special guest star,” I rolled my eyes while I\naddressed Skippy the way he insisted on.",
      "context_after": "“\nBish\n,” Jesse pleaded as we talked down the passageway.\n“Come on, man, ’fess up. What is going on? Where you been all this time?”",
      "paragraph_index": 40,
      "chapter_index": 36,
      "chapter_id": "Text/part0000_split_038.html"
    },
    {
      "skippy_text": "“OK,”\nSkippy sighed. “I have to own up to that. But I am\n totally\n worth it.”",
      "full_paragraph": "“OK,”\nSkippy sighed. “I have to own up to that. But I am\n totally\n worth it.”",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“Actually,”\na smile spread across Perkins’s face. “I believe she will think the whole story\nis wonderful. Colonel,” that time she caught herself. “Sir, for a long time, I\nthought Emby was connected with the Burgermeister.”\n“That\nwas part of the cover story,” I explained. “We left a lot of bread crumbs pointing\nin different directions, to confuse everyone. Hey, guys, we will have plenty of\ntime to talk. The reason I brought you here is to meet Emby himself. We call\nhim ‘Skippy’. He is an asshole-”",
      "context_after": "“\nMost",
      "paragraph_index": 103,
      "chapter_index": 36,
      "chapter_id": "Text/part0000_split_038.html"
    },
    {
      "skippy_text": "“A\nsuper-smart, nay, mind-bogglingly smart asshole,” Skippy said, looking down his\nnose.",
      "full_paragraph": "“A\nsuper-smart, nay, mind-bogglingly smart asshole,” Skippy said, looking down his\nnose.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "joe",
      "context_before": "“I \nlike\nhim already,” Bishop grinned. “Cadet Dandurf, when dealing with Skippy, you\nmust keep in mind that he is an asshole.”",
      "context_after": "Nert\nbent forward from the waist to peer at the avatar. “You realize that any kind\nof asshole is still, an \nasshole\n?”",
      "paragraph_index": 140,
      "chapter_index": 36,
      "chapter_id": "Text/part0000_split_038.html"
    },
    {
      "skippy_text": "“That\ntype of facility is called a ‘brewery’, and the planet’s correct name is either\n‘Gehtanu’ or ‘Paradise’,” Skippy said to correct our guest, because he knew\nthat people just\n love\n to be told they said something wrong.",
      "full_paragraph": "“That\ntype of facility is called a ‘brewery’, and the planet’s correct name is either\n‘Gehtanu’ or ‘Paradise’,” Skippy said to correct our guest, because he knew\nthat people just\n love\n to be told they said something wrong.",
      "trigger": "",
      "tones": [
        "neutral"
      ],
      "partner": "crew",
      "context_before": "“Most\npeople call me a \nbeer\n can,” Skippy spoke, and his canister glowed blue.\nHe didn’t do the glowing thing much anymore, now that he had an avatar. Blue\nmeant he was happy, if my memory is correct. “Though that is a human beverage.”\n“I\nknow what ‘beer’ is,” Jates’s expression did not change. “David Czjaka is part-owner\nof a beer factory on Pradassis.”",
      "context_after": "“Thank\nyou for clarifying that,” Jates said without his expression changing, except a\nblood vessel in his forehead throbbed.",
      "paragraph_index": 171,
      "chapter_index": 36,
      "chapter_id": "Text/part0000_split_038.html"
    }
  ]
}